[{"id": "http://arxiv.org/abs/2005.13691v1", "updated": "2020-05-27T22:41:02Z", "published": "2020-05-27T22:41:02Z", "title": "Challenges in Combating COVID-19 Infodemic -- Data, Tools, and Ethics", "summary": "While the COVID-19 pandemic continues its global devastation, numerous\naccompanying challenges emerge. One important challenge we face is to\nefficiently and effectively use recently gathered data and find computational\ntools to combat the COVID-19 infodemic, a typical information overloading\nproblem. Novel coronavirus presents many questions without ready answers; its\nuncertainty and our eagerness in search of solutions offer a fertile\nenvironment for infodemic. It is thus necessary to combat the infodemic and\nmake a concerted effort to confront COVID-19 and mitigate its negative impact\nin all walks of life when saving lives and maintaining normal orders during\ntrying times. In this position paper of combating the COVID-19 infodemic, we\nillustrate its need by providing real-world examples of rampant conspiracy\ntheories, misinformation, and various types of scams that take advantage of\nhuman kindness, fear, and ignorance. We present three key challenges in this\nfight against the COVID-19 infodemic where researchers and practitioners\ninstinctively want to contribute and help. We demonstrate that these three\nchallenges can and will be effectively addressed by collective wisdom,\ncrowdsourcing, and collaborative research.", "author": [{"name": "Kaize Ding"}, {"name": "Kai Shu"}, {"name": "Yichuan Li"}, {"name": "Amrita Bhattacharjee"}, {"name": "Huan Liu"}], "link": [{"@href": "http://arxiv.org/abs/2005.13691v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.13691v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2011.06249v4", "updated": "2021-08-19T04:58:00Z", "published": "2020-11-12T08:04:32Z", "title": "Characterizing the roles of bots during the COVID-19 infodemic on\n  Twitter", "summary": "An infodemic is an emerging phenomenon caused by an overabundance of\ninformation online. This proliferation of information makes it difficult for\nthe public to distinguish trustworthy news and credible information from\nuntrustworthy sites and non-credible sources. The perils of an infodemic\ndebuted with the outbreak of the COVID-19 pandemic and bots (i.e., automated\naccounts controlled by a set of algorithms) that are suspected of spreading the\ninfodemic. Although previous research has revealed that bots played a central\nrole in spreading misinformation during major political events, how bots\nbehaved during the infodemic is unclear. In this paper, we examined the roles\nof bots in the case of the COVID-19 infodemic and the diffusion of non-credible\ninformation such as \"5G\" and \"Bill Gates\" conspiracy theories and content\nrelated to \"Trump\" and \"WHO\" by analyzing retweet networks and retweeted items.\nWe show the segregated topology of their retweet networks, which indicates that\nright-wing self-media accounts and conspiracy theorists may lead to this\nopinion cleavage, while malicious bots might favor amplification of the\ndiffusion of non-credible information. Although the basic influence of\ninformation diffusion could be larger in human users than bots, the effects of\nbots are non-negligible under an infodemic situation.", "author": [{"name": "Wentao Xu"}, {"name": "Kazutoshi Sasahara"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Accepted by Journal of Computational Social Science (August 2021)"}, "link": [{"@href": "http://arxiv.org/abs/2011.06249v4", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2011.06249v4", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "J.4", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2104.10864v1", "updated": "2021-04-22T05:09:25Z", "published": "2021-04-22T05:09:25Z", "title": "Misinformation, Believability, and Vaccine Acceptance Over 40 Countries:\n  Takeaways From the Initial Phase of The COVID-19 Infodemic", "summary": "The COVID-19 pandemic has been damaging to the lives of people all around the\nworld. Accompanied by the pandemic is an infodemic, an abundant and\nuncontrolled spreading of potentially harmful misinformation. The infodemic may\nseverely change the pandemic's course by interfering with public health\ninterventions such as wearing masks, social distancing, and vaccination. In\nparticular, the impact of the infodemic on vaccination is critical because it\nholds the key to reverting to pre-pandemic normalcy. This paper presents\nfindings from a global survey on the extent of worldwide exposure to the\nCOVID-19 infodemic, assesses different populations' susceptibility to false\nclaims, and analyzes its association with vaccine acceptance. Based on\nresponses gathered from over 18,400 individuals from 40 countries, we find a\nstrong association between perceived believability of misinformation and\nvaccination hesitancy. Additionally, our study shows that only half of the\nonline users exposed to rumors might have seen the fact-checked information.\nMoreover, depending on the country, between 6% and 37% of individuals\nconsidered these rumors believable. Our survey also shows that poorer regions\nare more susceptible to encountering and believing COVID-19 misinformation. We\ndiscuss implications of our findings on public campaigns that proactively\nspread accurate information to countries that are more susceptible to the\ninfodemic. We also highlight fact-checking platforms' role in better\nidentifying and prioritizing claims that are perceived to be believable and\nhave wide exposure. Our findings give insights into better handling of risk\ncommunication during the initial phase of a future pandemic.", "author": [{"name": "Karandeep Singh"}, {"name": "Gabriel Lima"}, {"name": "Meeyoung Cha"}, {"name": "Chiyoung Cha"}, {"name": "Juhi Kulshrestha"}, {"name": "Yong-Yeol Ahn"}, {"name": "Onur Varol"}], "link": [{"@href": "http://arxiv.org/abs/2104.10864v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2104.10864v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2104.05745v1", "updated": "2021-04-12T18:13:40Z", "published": "2021-04-12T18:13:40Z", "title": "Fighting the COVID-19 Infodemic with a Holistic BERT Ensemble", "summary": "This paper describes the TOKOFOU system, an ensemble model for misinformation\ndetection tasks based on six different transformer-based pre-trained encoders,\nimplemented in the context of the COVID-19 Infodemic Shared Task for English.\nWe fine tune each model on each of the task's questions and aggregate their\nprediction scores using a majority voting approach. TOKOFOU obtains an overall\nF1 score of 89.7%, ranking first.", "author": [{"name": "Giorgos Tziafas"}, {"name": "Konstantinos Kogkalidis"}, {"name": "Tommaso Caselli"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "4 pages, NLP4IF 2021"}, "link": [{"@href": "http://arxiv.org/abs/2104.05745v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2104.05745v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2007.07996v2", "updated": "2021-04-09T08:52:10Z", "published": "2020-07-15T21:18:30Z", "title": "Fighting the COVID-19 Infodemic in Social Media: A Holistic Perspective\n  and a Call to Arms", "summary": "With the outbreak of the COVID-19 pandemic, people turned to social media to\nread and to share timely information including statistics, warnings, advice,\nand inspirational stories. Unfortunately, alongside all this useful\ninformation, there was also a new blending of medical and political\nmisinformation and disinformation, which gave rise to the first global\ninfodemic. While fighting this infodemic is typically thought of in terms of\nfactuality, the problem is much broader as malicious content includes not only\nfake news, rumors, and conspiracy theories, but also promotion of fake cures,\npanic, racism, xenophobia, and mistrust in the authorities, among others. This\nis a complex problem that needs a holistic approach combining the perspectives\nof journalists, fact-checkers, policymakers, government entities, social media\nplatforms, and society as a whole. Taking them into account we define an\nannotation schema and detailed annotation instructions, which reflect these\nperspectives. We performed initial annotations using this schema, and our\ninitial experiments demonstrated sizable improvements over the baselines. Now,\nwe issue a call to arms to the research community and beyond to join the fight\nby supporting our crowdsourcing annotation efforts.", "author": [{"name": "Firoj Alam"}, {"name": "Fahim Dalvi"}, {"name": "Shaden Shaar"}, {"name": "Nadir Durrani"}, {"name": "Hamdy Mubarak"}, {"name": "Alex Nikolov"}, {"name": "Giovanni Da San Martino"}, {"name": "Ahmed Abdelali"}, {"name": "Hassan Sajjad"}, {"name": "Kareem Darwish"}, {"name": "Preslav Nakov"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "COVID-19, Infodemic, Disinformation, Misinformation, Fake News, Call\n  to Arms, Crowdsourcing Annotations"}, "link": [{"@href": "http://arxiv.org/abs/2007.07996v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2007.07996v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T50", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2.7", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2008.08513v1", "updated": "2020-08-19T15:44:36Z", "published": "2020-08-19T15:44:36Z", "title": "Covid-19 infodemic reveals new tipping point epidemiology and a revised\n  $R$ formula", "summary": "Many governments have managed to control their COVID-19 outbreak with a\nsimple message: keep the effective '$R$ number' $R<1$ to prevent widespread\ncontagion and flatten the curve. This raises the question whether a similar\npolicy could control dangerous online 'infodemics' of information,\nmisinformation and disinformation. Here we show, using multi-platform data from\nthe COVID-19 infodemic, that its online spreading instead encompasses a\ndifferent dynamical regime where communities and users within and across\nindependent platforms, sporadically form temporary active links on similar\ntimescales to the viral spreading. This allows material that might have died\nout, to evolve and even mutate. This has enabled niche networks that were\nalready successfully spreading hate and anti-vaccination material, to rapidly\nbecome global super-spreaders of narratives featuring fake COVID-19 treatments,\nanti-Asian sentiment and conspiracy theories. We derive new tools that\nincorporate these coupled social-viral dynamics, including an online $R$, to\nhelp prevent infodemic spreading at all scales: from spreading across platforms\n(e.g. Facebook, 4Chan) to spreading within a given subpopulation, or community,\nor topic. By accounting for similar social and viral timescales, the same\nmathematical theory also offers a quantitative description of other\nunconventional infection profiles such as rumors spreading in financial markets\nand colds spreading in schools.", "author": [{"name": "N. F. Johnson"}, {"name": "N. Velasquez"}, {"name": "O. K. Jha"}, {"name": "H. Niyazi"}, {"name": "R. Leahy"}, {"name": "N. Johnson Restrepo"}, {"name": "R. Sear"}, {"name": "P. Manrique"}, {"name": "Y. Lupu"}, {"name": "P. Devkota"}, {"name": "S. Wuchty"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Working paper. Comments welcome to neiljohnson@gwu.edu"}, "link": [{"@href": "http://arxiv.org/abs/2008.08513v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2008.08513v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "nlin.AO", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2107.07946v1", "updated": "2021-07-16T15:03:52Z", "published": "2021-07-16T15:03:52Z", "title": "The COVID-19 infodemic does not affect vaccine acceptance", "summary": "How does information consumption affect behaviour in the context of the\nCOVID-19 pandemic? A popular hypothesis states that the so-called infodemics\nhas substantial impact on orienting individual decisions. A competing\nhypothesis stresses that exposure to vast amounts of even contradictory\ninformation has little effect on personal choices. We analyse the vaccine\ninfodemics on Twitter and Facebook by looking at 146M contents produced by 20M\naccounts between 1 January 2020 and 30 April 2021. We find that vaccine-related\nnews triggered huge interest through social media, affecting attention patterns\nand the modality in which information was spreading. However, we find that such\na tumultuous information landscape translated in only minimal variations in\nvaccine acceptance as measured by Facebook's daily COVID-19 World Symptoms\nSurvey on a sample of 1.6M users. This finding supports the hypothesis that\naltered information consumption patterns are not a reliable predictor of\nbehavioural change. Instead, wider attention on social media seems to resolve\nin polarisation, with the vaccine-prone and the vaccine-hesitant maintaining\ntheir positions.", "author": [{"name": "Carlo M. Valensise"}, {"name": "Matteo Cinelli"}, {"name": "Matthieu Nadini"}, {"name": "Alessandro Galeazzi"}, {"name": "Antonio Peruzzi"}, {"name": "Gabriele Etta"}, {"name": "Fabiana Zollo"}, {"name": "Andrea Baronchelli"}, {"name": "Walter Quattrociocchi"}], "link": [{"@href": "http://arxiv.org/abs/2107.07946v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.07946v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2005.05513v2", "updated": "2020-05-13T16:47:44Z", "published": "2020-05-12T01:51:07Z", "title": "Psychometric Analysis and Coupling of Emotions Between State Bulletins\n  and Twitter in India during COVID-19 Infodemic", "summary": "COVID-19 infodemic has been spreading faster than the pandemic itself. The\nmisinformation riding upon the infodemic wave poses a major threat to people's\nhealth and governance systems. Since social media is the largest source of\ninformation, managing the infodemic not only requires mitigating of\nmisinformation but also an early understanding of psychological patterns\nresulting from it. During the COVID-19 crisis, Twitter alone has seen a sharp\n45% increase in the usage of its curated events page, and a 30% increase in its\ndirect messaging usage, since March 6th 2020. In this study, we analyze the\npsychometric impact and coupling of the COVID-19 infodemic with the official\nbulletins related to COVID-19 at the national and state level in India. We look\nat these two sources with a psycho-linguistic lens of emotions and quantified\nthe extent and coupling between the two. We modified path, a deep skip-gram\nbased open-sourced lexicon builder for effective capture of health-related\nemotions. We were then able to capture the time-evolution of health-related\nemotions in social media and official bulletins. An analysis of lead-lag\nrelationships between the time series of extracted emotions from official\nbulletins and social media using Granger's causality showed that state\nbulletins were leading the social media for some emotions such as Medical\nEmergency. Further insights that are potentially relevant for the policymaker\nand the communicators actively engaged in mitigating misinformation are also\ndiscussed. Our paper also introduces CoronaIndiaDataset2, the first social\nmedia based COVID-19 dataset at national and state levels from India with over\n5.6 million national and 2.6 million state-level tweets. Finally, we present\nour findings as COVibes, an interactive web application capturing psychometric\ninsights captured upon the CoronaIndiaDataset, both at a national and state\nlevel.", "author": [{"name": "Baani Leen Kaur Jolly"}, {"name": "Palash Aggrawal"}, {"name": "Amogh Gulati"}, {"name": "Amarjit Singh Sethi"}, {"name": "Ponnurangam Kumaraguru"}, {"name": "Tavpritesh Sethi"}], "link": [{"@href": "http://arxiv.org/abs/2005.05513v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.05513v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2007.12226v2", "updated": "2020-10-01T16:44:25Z", "published": "2020-07-23T19:43:27Z", "title": "Understanding the dynamics emerging from infodemics: A call to action\n  for interdisciplinary research", "summary": "Research on infodemics, i.e., the rapid spread of (mis)information related to\na hazardous event, such as the COVID-19 pandemic, requires the integration of a\nmultiplicity of scientific disciplines. The dynamics emerging from infodemics\nhave the potential to generate complex behavioral patterns. In order to react\nappropriately, it is of ultimate importance for the fields of Business and\nEconomics to understand the dynamics emerging from it. In the short run,\ndynamics might lead to an adaptation in household spending or to a shift in\nbuying behavior towards online providers. In the long run, changes in\ninvestments, consumer behavior, and markets are to be expected. We argue that\nthe dynamics emerge from complex interactions among multiple factors, such as\ninformation and misinformation accessible for individuals and the formation and\nrevision of beliefs. (Mis)information accessible to individuals is, amongst\nothers, affected by algorithms specifically designed to provide personalized\ninformation, while automated fact-checking algorithms can help reduce the\namount of circulating misinformation. The formation and revision of individual\n(and probably false) beliefs and individual fact-checking and interpretation of\ninformation are heavily affected by linguistic patterns inherent to information\nduring pandemics and infodemics and further factors, such as affect, intuition\nand motives. We argue that, in order to get a deep(er) understanding of the\ndynamics emerging from infodemics, the fields of Business and Economics should\nintegrate the perspectives of Computer Science and Information Systems,\n(Computational) Linguistics, and Cognitive Science into the wider context of\neconomic systems (e.g., organizations, markets or industries) and propose a way\nto do so.", "author": [{"name": "Stephan Leitner"}, {"name": "Bartosz Gula"}, {"name": "Dietmar Jannach"}, {"name": "Ulrike Krieg-Holz"}, {"name": "Friederike Wall"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "16 pages"}, "link": [{"@href": "http://arxiv.org/abs/2007.12226v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2007.12226v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "econ.GN", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "math.DS", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "q-fin.EC", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68Q11, 68U35, 91E10, 68T50, 91F20, 91B44, 91B70", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "H.4; J.4; J.5", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2005.00033v2", "updated": "2020-06-09T13:33:12Z", "published": "2020-04-30T18:04:20Z", "title": "Fighting the COVID-19 Infodemic: Modeling the Perspective of\n  Journalists, Fact-Checkers, Social Media Platforms, Policy Makers, and the\n  Society", "summary": "With the emergence of the COVID-19 pandemic, the political and the medical\naspects of disinformation merged as the problem got elevated to a whole new\nlevel to become the first global infodemic. Fighting this infodemic is ranked\nsecond in the list of the most important focus areas of the World Health\nOrganization, with dangers ranging from promoting fake cures, rumors, and\nconspiracy theories to spreading xenophobia and panic. Addressing the issue\nrequires solving a number of challenging problems such as identifying messages\ncontaining claims, determining their check-worthiness and factuality, and their\npotential to do harm as well as the nature of that harm, to mention just a few.\nThus, here we design, annotate, and release to the research community a new\ndataset for fine-grained disinformation analysis that (i)focuses on COVID-19,\n(ii) combines the perspectives and the interests of journalists, fact-checkers,\nsocial media platforms, policy makers, and society as a whole, and (iii) covers\nboth English and Arabic. Finally, we show strong evaluation results using\nstate-of-the-art Transformers, thus confirming the practical utility of the\nannotation schema and of the dataset.", "author": [{"name": "Firoj Alam"}, {"name": "Shaden Shaar"}, {"name": "Fahim Dalvi"}, {"name": "Hassan Sajjad"}, {"name": "Alex Nikolov"}, {"name": "Hamdy Mubarak"}, {"name": "Giovanni Da San Martino"}, {"name": "Ahmed Abdelali"}, {"name": "Nadir Durrani"}, {"name": "Kareem Darwish"}, {"name": "Preslav Nakov"}], "link": [{"@href": "http://arxiv.org/abs/2005.00033v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.00033v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T50", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2; I.2.7", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2005.07266v2", "updated": "2021-04-21T08:27:12Z", "published": "2020-05-14T21:14:15Z", "title": "Characterizing information leaders in Twitter during COVID-19 crisis", "summary": "Information is key during a crisis such as the one produced by the current\nCOVID-19 pandemic as it greatly shapes people opinion, behavior and their\npsychology. Infodemic of misinformation is an important secondary crisis\nassociated to the pandemic. Infodemics can amplify the real negative\nconsequences of the pandemic in different dimensions: social, economic and even\nsanitary. For instance, infodemics can lead to hatred between population groups\nthat fragment the society influencing its response or result in negative habits\nthat help the pandemic propagate. On the contrary, reliable and trustful\ninformation along with messages of hope and solidarity can be used to control\nthe pandemic, build safety nets and help promote resilience. We propose the\nfoundation of a framework to characterize leaders in Twitter based on the\nanalysis of the social graph derived from the activity in this social network.\nCentrality metrics are used to characterize the topology of the network and the\nnodes as potential leaders. These metrics are compared with the user popularity\nmetrics managed by Twitter. We then assess the resulting topology of clusters\nof leaders visually. We propose this tool to be the basis for a system to\ndetect and empower users with a positive influence in the collective behavior\nof the network and the propagation of information.", "author": {"name": "David Pastor-Escuredo"}, "link": [{"@href": "http://arxiv.org/abs/2005.07266v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.07266v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2011.08787v1", "updated": "2020-11-17T17:30:10Z", "published": "2020-11-17T17:30:10Z", "title": "The COVID19 infodemic. The role and place of academics in science\n  communication", "summary": "As the COVID19 pandemic has spread across the world, a concurrent pandemic of\ninformation has spread with it. Deemed an infodemic by the World Health\nOrganization, and described as an overabundance of information, some accurate,\nsome not, that occurs during an epidemic, this proliferation of data, research\nand opinions provides both opportunities and challenges for academics.\nAcademics and scientists have a key role to play in the solutions to the\ninfodemic challenge: as educators, influences and communicators, even where\ntheir expertise and experience does not align precisely with the SARS-Cov2\nvirus and its impacts.\n  Successful communication requires a better understanding of how the public\nseeks, understands and processes scientific information, however, in order to\nmaximise the ways in which experts engage with traditional and social media and\nto make sure that such engagement does not add to confusion and misinformation\nalongside efforts to counter or challenge it. This paper will outline the key\nadvantages to be had from greater engagement with COVID19 discussions, the\npopular channels through which such discussions take place and through which\ninformation is disseminated. It also warns against the common pitfalls those\nwho choose to engage might encounter, whilst stressing that the disadvantages\nof doing so are far outweighed by the advantages such engagement offers.", "author": {"name": "Jennifer Cole"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "17 Pages"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Global Journal of Medicine and Public Health Vol 9 Issue 2 2020"}, "link": [{"@href": "http://arxiv.org/abs/2011.08787v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2011.08787v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2012.02586v2", "updated": "2020-12-07T03:00:54Z", "published": "2020-12-04T13:46:42Z", "title": "TrollHunter [Evader]: Automated Detection [Evasion] of Twitter Trolls\n  During the COVID-19 Pandemic", "summary": "This paper presents TrollHunter, an automated reasoning mechanism we used to\nhunt for trolls on Twitter during the COVID-19 pandemic in 2020. Trolls, poised\nto disrupt the online discourse and spread disinformation, quickly seized the\nabsence of a credible response to COVID-19 and created a COVID-19 infodemic by\npromulgating dubious content on Twitter. To counter the COVID-19 infodemic, the\nTrollHunter leverages a unique linguistic analysis of a multi-dimensional set\nof Twitter content features to detect whether or not a tweet was meant to\ntroll. TrollHunter achieved 98.5% accuracy, 75.4% precision and 69.8% recall\nover a dataset of 1.3 million tweets. Without a final resolution of the\npandemic in sight, it is unlikely that the trolls will go away, although they\nmight be forced to evade automated hunting. To explore the plausibility of this\nstrategy, we developed and tested an adversarial machine learning mechanism\ncalled TrollHunter-Evader. TrollHunter-Evader employs a Test Time Evasion (TTE)\napproach in a combination with a Markov chain-based mechanism to recycle\noriginally trolling tweets. The recycled tweets were able to achieve a\nremarkable 40% decrease in the TrollHunter's ability to correctly identify\ntrolling tweets. Because the COVID-19 infodemic could have a harmful impact on\nthe COVID-19 pandemic, we provide an elaborate discussion about the\nimplications of employing adversarial machine learning to evade Twitter troll\nhunts.", "author": [{"name": "Peter Jachim"}, {"name": "Filipo Sharevski"}, {"name": "Paige Treebridge"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Accepted for publication at NSPW 2020"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "New Security Paradigms Workshop (NSPW) 2020"}, "link": [{"@href": "http://arxiv.org/abs/2012.02586v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2012.02586v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CR", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2012.09353v2", "updated": "2021-04-03T00:22:38Z", "published": "2020-12-17T02:00:43Z", "title": "The COVID-19 Infodemic: Twitter versus Facebook", "summary": "The global spread of the novel coronavirus is affected by the spread of\nrelated misinformation -- the so-called COVID-19 Infodemic -- that makes\npopulations more vulnerable to the disease through resistance to mitigation\nefforts. Here we analyze the prevalence and diffusion of links to\nlow-credibility content about the pandemic across two major social media\nplatforms, Twitter and Facebook. We characterize cross-platform similarities\nand differences in popular sources, diffusion patterns, influencers,\ncoordination, and automation. Comparing the two platforms, we find divergence\namong the prevalence of popular low-credibility sources and suspicious videos.\nA minority of accounts and pages exert a strong influence on each platform.\nThese misinformation \"superspreaders\" are often associated with the\nlow-credibility sources and tend to be verified by the platforms. On both\nplatforms, there is evidence of coordinated sharing of Infodemic content. The\novert nature of this manipulation points to the need for societal-level\nsolutions in addition to mitigation strategies within the platforms. However,\nwe highlight limits imposed by inconsistent data-access policies on our\ncapability to study harmful manipulations of information ecosystems.", "author": [{"name": "Kai-Cheng Yang"}, {"name": "Francesco Pierri"}, {"name": "Pik-Mai Hui"}, {"name": "David Axelrod"}, {"name": "Christopher Torres-Lugo"}, {"name": "John Bryden"}, {"name": "Filippo Menczer"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "25 pages, 10 figures"}, "link": [{"@href": "http://arxiv.org/abs/2012.09353v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2012.09353v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2008.08364v1", "updated": "2020-08-19T10:20:24Z", "published": "2020-08-19T10:20:24Z", "title": "Experts and authorities receive disproportionate attention on Twitter\n  during the COVID-19 crisis", "summary": "Timely access to accurate information is crucial during the COVID-19\npandemic. Prompted by key stakeholders' cautioning against an \"infodemic\", we\nstudy information sharing on Twitter from January through May 2020. We observe\nan overall surge in the volume of general as well as COVID-19-related tweets\naround peak lockdown in March/April 2020. With respect to engagement (retweets\nand likes), accounts related to healthcare, science, government and politics\nreceived by far the largest boosts, whereas accounts related to religion and\nsports saw a relative decrease in engagement. While the threat of an\n\"infodemic\" remains, our results show that social media also provide a platform\nfor experts and public authorities to be widely heard during a global crisis.", "author": [{"name": "Kristina Gligorić"}, {"name": "Manoel Horta Ribeiro"}, {"name": "Martin Müller"}, {"name": "Olesia Altunina"}, {"name": "Maxime Peyrard"}, {"name": "Marcel Salathé"}, {"name": "Giovanni Colavizza"}, {"name": "Robert West"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Kristina Gligori\\'c, Manoel Horta Ribeiro and Martin M\\\"uller\n  contributed equally to this work"}, "link": [{"@href": "http://arxiv.org/abs/2008.08364v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2008.08364v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2011.03327v4", "updated": "2021-05-26T15:38:55Z", "published": "2020-11-06T13:09:37Z", "title": "Fighting an Infodemic: COVID-19 Fake News Dataset", "summary": "Along with COVID-19 pandemic we are also fighting an `infodemic'. Fake news\nand rumors are rampant on social media. Believing in rumors can cause\nsignificant harm. This is further exacerbated at the time of a pandemic. To\ntackle this, we curate and release a manually annotated dataset of 10,700\nsocial media posts and articles of real and fake news on COVID-19. We benchmark\nthe annotated dataset with four machine learning baselines - Decision Tree,\nLogistic Regression, Gradient Boost, and Support Vector Machine (SVM). We\nobtain the best performance of 93.46% F1-score with SVM. The data and code is\navailable at: https://github.com/parthpatwa/covid19-fake-news-dectection", "author": [{"name": "Parth Patwa"}, {"name": "Shivam Sharma"}, {"name": "Srinivas Pykl"}, {"name": "Vineeth Guptha"}, {"name": "Gitanjali Kumari"}, {"name": "Md Shad Akhtar"}, {"name": "Asif Ekbal"}, {"name": "Amitava Das"}, {"name": "Tanmoy Chakraborty"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1007/978-3-030-73696-5_3"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1007/978-3-030-73696-5_3", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2011.03327v4", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2011.03327v4", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Published at CONSTRAINT-2021, Collocated with AAAI-2021"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2011.14146v2", "updated": "2021-02-15T02:26:25Z", "published": "2020-11-28T15:30:14Z", "title": "Towards Combating Pandemic-related Misinformation in Social Media", "summary": "Conventional preventive measures during pandemic include social distancing\nand lockdown. Such measures in the time of social media brought about a new set\nof challenges - vulnerability to the toxic impact of online misinformation is\nhigh. A case in point is the prevailing COVID-19; as the virus propagates, so\ndoes the associated misinformation and fake news about it leading to infodemic.\nSince the outbreak, there has been a surge of studies investigating various\naspects of the pandemic. Of interest to this chapter include studies centring\non datasets from online social media platforms where the bulk of the public\ndiscourse happen. Consequently, the main goal is to support the fight against\nnegative infodemic by (1) contributing a diverse set of curated relevant\ndatasets (2) recommending relevant areas to study using the datasets (3)\ndiscussion on how relevant datasets, strategies and state-of-the-art IT tools\ncan be leveraged in managing the pandemic.", "author": {"name": "Isa Inuwa-Dutse"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "13 pages, 5 figures"}, "link": [{"@href": "http://arxiv.org/abs/2011.14146v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2011.14146v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2012.09536v1", "updated": "2020-12-17T12:17:55Z", "published": "2020-12-17T12:17:55Z", "title": "Conspiracy Machines -- The Role of Social Bots during the COVID-19\n  Infodemic", "summary": "The omnipresent COVID-19 pandemic gave rise to a parallel spreading of\nmisinformation, also referred to as an Infodemic. Consequently, social media\nhave become targets for the application of social bots, that is, algorithms\nthat mimic human behaviour. Their ability to exert influence on social media\ncan be exploited by amplifying misinformation, rumours, or conspiracy theories\nwhich might be harmful to society and the mastery of the pandemic. By applying\nsocial bot detection and content analysis techniques, this study aims to\ndetermine the extent to which social bots interfere with COVID- 19 discussions\non Twitter. A total of 78 presumptive bots were detected within a sample of\n542,345 users. The analysis revealed that bot-like users who disseminate\nmisinformation, at the same time, intersperse news from renowned sources. The\nfindings of this research provide implications for improved bot detection and\nmanaging potential threats through social bots during ongoing and future\ncrises.", "author": [{"name": "Julian Marx"}, {"name": "Felix Brünker"}, {"name": "Milad Mirbabaie"}, {"name": "Eric Hochstrate"}], "link": [{"@href": "http://arxiv.org/abs/2012.09536v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2012.09536v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2104.12201v1", "updated": "2021-04-25T16:49:23Z", "published": "2021-04-25T16:49:23Z", "title": "Transformers to Fight the COVID-19 Infodemic", "summary": "The massive spread of false information on social media has become a global\nrisk especially in a global pandemic situation like COVID-19. False information\ndetection has thus become a surging research topic in recent months.\nNLP4IF-2021 shared task on fighting the COVID-19 infodemic has been organised\nto strengthen the research in false information detection where the\nparticipants are asked to predict seven different binary labels regarding false\ninformation in a tweet. The shared task has been organised in three languages;\nArabic, Bulgarian and English. In this paper, we present our approach to tackle\nthe task objective using transformers. Overall, our approach achieves a 0.707\nmean F1 score in Arabic, 0.578 mean F1 score in Bulgarian and 0.864 mean F1\nscore in English ranking 4th place in all the languages.", "author": [{"name": "Lasitha Uyangodage"}, {"name": "Tharindu Ranasinghe"}, {"name": "Hansi Hettiarachchi"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Accepted to Workshop on NLP for Internet Freedom (NLP4IF) at NAACL\n  2021"}, "link": [{"@href": "http://arxiv.org/abs/2104.12201v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2104.12201v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2106.08684v1", "updated": "2021-06-16T10:44:29Z", "published": "2021-06-16T10:44:29Z", "title": "Infodemics on Youtube: Reliability of Content and Echo Chambers on\n  COVID-19", "summary": "Social media radically changed how information is consumed and reported.\nMoreover, social networks elicited a disintermediated access to an\nunprecedented amount of content. The world health organization (WHO) coined the\nterm infodemics to identify the information overabundance during an epidemic.\nIndeed, the spread of inaccurate and misleading information may alter behaviors\nand complicate crisis management and health responses. This paper addresses\ninformation diffusion during the COVID-19 pandemic period with a massive data\nanalysis on YouTube. First, we analyze more than 2M users' engagement in 13000\nvideos released by 68 different YouTube channels, with different political bias\nand fact-checking indexes. We then investigate the relationship between each\nuser's political preference and her/his consumption of questionable/reliable\ninformation. Our results, quantified using information theory measures, provide\nevidence for the existence of echo chambers across two dimensions represented\nby the political bias and by the trustworthiness of information channels.\nFinally, we observe that the echo chamber structure cannot be reproduced after\nproperly randomizing the users' interaction patterns.", "author": [{"name": "Niccolò Di Marco"}, {"name": "Matteo Cinelli"}, {"name": "Walter Quattrociocchi"}], "link": [{"@href": "http://arxiv.org/abs/2106.08684v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2106.08684v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2107.02012v1", "updated": "2021-07-01T11:07:47Z", "published": "2021-07-01T11:07:47Z", "title": "Tackling COVID-19 Infodemic using Deep Learning", "summary": "Humanity is battling one of the most deleterious virus in modern history, the\nCOVID-19 pandemic, but along with the pandemic there's an infodemic permeating\nthe pupil and society with misinformation which exacerbates the current malady.\nWe try to detect and classify fake news on online media to detect fake\ninformation relating to COVID-19 and coronavirus. The dataset contained fake\nposts, articles and news gathered from fact checking websites like politifact\nwhereas real tweets were taken from verified twitter handles. We incorporated\nmultiple conventional classification techniques like Naive Bayes, KNN, Gradient\nBoost and Random Forest along with Deep learning approaches, specifically CNN,\nRNN, DNN and the ensemble model RMDL. We analyzed these approaches with two\nfeature extraction techniques, TF-IDF and GloVe Word Embeddings which would\nprovide deeper insights into the dataset containing COVID-19 info on online\nmedia.", "author": [{"name": "Prathmesh Pathwar"}, {"name": "Simran Gill"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "15 pages, 4 figures, Accepted in 4th International Conference on\n  Computational Intelligence and Data Engineering"}, "link": [{"@href": "http://arxiv.org/abs/2107.02012v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.02012v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2007.09682v3", "updated": "2021-03-26T18:35:43Z", "published": "2020-07-19T14:52:34Z", "title": "Twitter and Facebook posts about COVID-19 are less likely to spread\n  false and low-credibility content compared to other health topics", "summary": "On February 2, 2020, the World Health Organization declared a COVID-19 social\nmedia \"infodemic\", with special attention to misinformation -- frequently\nunderstood as false claims. To understand the infodemic's scope and scale, we\nanalyzed over 500 million posts from Twitter and Facebook about COVID-19 and\nother health topics, between March 8 and May 1, 2020. Following prior work, we\nassumed URL source credibility is a proxy for false content, but we also tested\nthis assumption. Contrary to expectations, we found that messages about\nCOVID-19 were more likely to contain links to more credible sources.\nAdditionally, messages linking to government sources, and to news with\nintermediate credibility, were shared more often, on average, than links to\nnon-credible sources. These results suggest that more ambiguous forms of\nmisinformation about COVID-19 may be more likely to be disseminated through\ncredible sources when compared to other health topics. Furthermore, the\nassumption that credibility is an adequate proxy for false content may\noverestimate the prevalence of false content online: less than 25% of posts\nlinking to the least credible sources contained false content. Our results\nemphasize the importance of distinguishing between explicit falsehoods and more\nambiguous forms of misinformation due to the search for meaning in an\nenvironment of scientific uncertainty.", "author": [{"name": "David A. Broniatowski"}, {"name": "Daniel Kerchner"}, {"name": "Fouzia Farooq"}, {"name": "Xiaolei Huang"}, {"name": "Amelia M. Jamison"}, {"name": "Mark Dredze"}, {"name": "Sandra Crouse Quinn"}], "link": [{"@href": "http://arxiv.org/abs/2007.09682v3", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2007.09682v3", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2009.02931v1", "updated": "2020-09-07T08:03:21Z", "published": "2020-09-07T08:03:21Z", "title": "Team Alex at CLEF CheckThat! 2020: Identifying Check-Worthy Tweets With\n  Transformer Models", "summary": "While misinformation and disinformation have been thriving in social media\nfor years, with the emergence of the COVID-19 pandemic, the political and the\nhealth misinformation merged, thus elevating the problem to a whole new level\nand giving rise to the first global infodemic. The fight against this infodemic\nhas many aspects, with fact-checking and debunking false and misleading claims\nbeing among the most important ones. Unfortunately, manual fact-checking is\ntime-consuming and automatic fact-checking is resource-intense, which means\nthat we need to pre-filter the input social media posts and to throw out those\nthat do not appear to be check-worthy. With this in mind, here we propose a\nmodel for detecting check-worthy tweets about COVID-19, which combines deep\ncontextualized text representations with modeling the social context of the\ntweet. We further describe a number of additional experiments and comparisons,\nwhich we believe should be useful for future research as they provide some\nindication about what techniques are effective for the task. Our official\nsubmission to the English version of CLEF-2020 CheckThat! Task 1, system\nTeam_Alex, was ranked second with a MAP score of 0.8034, which is almost tied\nwith the wining system, lagging behind by just 0.003 MAP points absolute.", "author": [{"name": "Alex Nikolov"}, {"name": "Giovanni Da San Martino"}, {"name": "Ivan Koychev"}, {"name": "Preslav Nakov"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Check-worthiness; Fact-Checking; Veracity"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "CLEF-2020"}, "link": [{"@href": "http://arxiv.org/abs/2009.02931v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2009.02931v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T50", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2.7", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2101.01076v1", "updated": "2020-12-21T15:49:19Z", "published": "2020-12-21T15:49:19Z", "title": "Understanding Health Misinformation Transmission: An Interpretable Deep\n  Learning Approach to Manage Infodemics", "summary": "Health misinformation on social media devastates physical and mental health,\ninvalidates health gains, and potentially costs lives. Understanding how health\nmisinformation is transmitted is an urgent goal for researchers, social media\nplatforms, health sectors, and policymakers to mitigate those ramifications.\nDeep learning methods have been deployed to predict the spread of\nmisinformation. While achieving the state-of-the-art predictive performance,\ndeep learning methods lack the interpretability due to their blackbox nature.\nTo remedy this gap, this study proposes a novel interpretable deep learning\napproach, Generative Adversarial Network based Piecewise Wide and Attention\nDeep Learning (GAN-PiWAD), to predict health misinformation transmission in\nsocial media. Improving upon state-of-the-art interpretable methods, GAN-PiWAD\ncaptures the interactions among multi-modal data, offers unbiased estimation of\nthe total effect of each feature, and models the dynamic total effect of each\nfeature when its value varies. We select features according to social exchange\ntheory and evaluate GAN-PiWAD on 4,445 misinformation videos. The proposed\napproach outperformed strong benchmarks. Interpretation of GAN-PiWAD indicates\nvideo description, negative video content, and channel credibility are key\nfeatures that drive viral transmission of misinformation. This study\ncontributes to IS with a novel interpretable deep learning method that is\ngeneralizable to understand other human decision factors. Our findings provide\ndirect implications for social media platforms and policymakers to design\nproactive interventions to identify misinformation, control transmissions, and\nmanage infodemics.", "author": [{"name": "Jiaheng Xie"}, {"name": "Yidong Chai"}, {"name": "Xiao Liu"}], "link": [{"@href": "http://arxiv.org/abs/2101.01076v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2101.01076v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2101.01688v2", "updated": "2021-02-25T15:42:49Z", "published": "2021-01-05T18:21:03Z", "title": "What social media told about us in the time of COVID-19: a scoping\n  review", "summary": "With the onset of COVID-19 pandemic, social media has rapidly become a\ncrucial communication tool for information generation, dissemination, and\nconsumption. In this scoping review, we selected and examined peer-reviewed\nempirical studies relating to COVID-19 and social media during the first\noutbreak starting in November 2019 until May 2020. From an analysis of 81\nstudies, we identified five overarching public health themes concerning the\nrole of online social platforms and COVID-19. These themes focused on: (i)\nsurveying public attitudes, (ii) identifying infodemics, (iii) assessing mental\nhealth, (iv) detecting or predicting COVID-19 cases, (v) analyzing government\nresponses to the pandemic, and (vi) evaluating quality of health information in\nprevention education videos. Furthermore, our review highlights the paucity of\nstudies on the application of machine learning on social media data related to\nCOVID-19 and a lack of studies documenting real-time surveillance developed\nwith social media data on COVID-19. For COVID-19, social media can play a\ncrucial role in disseminating health information as well as tackling infodemics\nand misinformation.", "author": [{"name": "Shu-Feng Tsao"}, {"name": "Helen Chen"}, {"name": "Therese Tisseverasinghe"}, {"name": "Yang Yang"}, {"name": "Lianghua Li"}, {"name": "Zahid A. Butt"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1016/S2589-7500(20)30315-0"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1016/S2589-7500(20)30315-0", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2101.01688v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2101.01688v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "20 pages excluding reference list and table 2. 2 figures. Accepted\n  manuscripts by Lancet Digital Health"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "The Lancet Digital Health, Review, Vol 3, Iss 3, E175-E194, March\n  01, 2021"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2101.03841v1", "updated": "2021-01-11T12:23:41Z", "published": "2021-01-11T12:23:41Z", "title": "Model Generalization on COVID-19 Fake News Detection", "summary": "Amid the pandemic COVID-19, the world is facing unprecedented infodemic with\nthe proliferation of both fake and real information. Considering the\nproblematic consequences that the COVID-19 fake-news have brought, the\nscientific community has put effort to tackle it. To contribute to this fight\nagainst the infodemic, we aim to achieve a robust model for the COVID-19\nfake-news detection task proposed at CONSTRAINT 2021 (FakeNews-19) by taking\ntwo separate approaches: 1) fine-tuning transformers based language models with\nrobust loss functions and 2) removing harmful training instances through\ninfluence calculation. We further evaluate the robustness of our models by\nevaluating on different COVID-19 misinformation test set (Tweets-19) to\nunderstand model generalization ability. With the first approach, we achieve\n98.13% for weighted F1 score (W-F1) for the shared task, whereas 38.18% W-F1 on\nthe Tweets-19 highest. On the contrary, by performing influence data cleansing,\nour model with 99% cleansing percentage can achieve 54.33% W-F1 score on\nTweets-19 with a trade-off. By evaluating our models on two COVID-19 fake-news\ntest sets, we suggest the importance of model generalization ability in this\ntask to step forward to tackle the COVID-19 fake-news problem in online social\nmedia platforms.", "author": [{"name": "Yejin Bang"}, {"name": "Etsuko Ishii"}, {"name": "Samuel Cahyawijaya"}, {"name": "Ziwei Ji"}, {"name": "Pascale Fung"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "CONSTRAINT Workshop 2021 (Camera Ready Version)"}, "link": [{"@href": "http://arxiv.org/abs/2101.03841v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2101.03841v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2005.08820v1", "updated": "2020-05-18T15:53:13Z", "published": "2020-05-18T15:53:13Z", "title": "Critical Impact of Social Networks Infodemic on Defeating Coronavirus\n  COVID-19 Pandemic: Twitter-Based Study and Research Directions", "summary": "News creation and consumption has been changing since the advent of social\nmedia. An estimated 2.95 billion people in 2019 used social media worldwide.\nThe widespread of the Coronavirus COVID-19 resulted with a tsunami of social\nmedia. Most platforms were used to transmit relevant news, guidelines and\nprecautions to people. According to WHO, uncontrolled conspiracy theories and\npropaganda are spreading faster than the COVID-19 pandemic itself, creating an\ninfodemic and thus causing psychological panic, misleading medical advises, and\neconomic disruption. Accordingly, discussions have been initiated with the\nobjective of moderating all COVID-19 communications, except those initiated\nfrom trusted sources such as the WHO and authorized governmental entities. This\npaper presents a large-scale study based on data mined from Twitter. Extensive\nanalysis has been performed on approximately one million COVID-19 related\ntweets collected over a period of two months. Furthermore, the profiles of\n288,000 users were analyzed including unique users profiles, meta-data and\ntweets context. The study noted various interesting conclusions including the\ncritical impact of the (1) exploitation of the COVID-19 crisis to redirect\nreaders to irrelevant topics and (2) widespread of unauthentic medical\nprecautions and information. Further data analysis revealed the importance of\nusing social networks in a global pandemic crisis by relying on credible users\nwith variety of occupations, content developers and influencers in specific\nfields. In this context, several insights and findings have been provided while\nelaborating computing and non-computing implications and research directions\nfor potential solutions and social networks management strategies during crisis\nperiods.", "author": [{"name": "Azzam Mourad"}, {"name": "Ali Srour"}, {"name": "Haidar Harmanani"}, {"name": "Cathia Jenainatiy"}, {"name": "Mohamad Arafeh"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1109/TNSM.2020.3031034"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1109/TNSM.2020.3031034", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2005.08820v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.08820v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "11 pages, 10 figures, Journal Article"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "https://ieeexplore.ieee.org/document/9223699 (2020)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2008.05701v1", "updated": "2020-08-13T05:53:24Z", "published": "2020-08-13T05:53:24Z", "title": "The COVID-19 Infodemic: Can the Crowd Judge Recent Misinformation\n  Objectively?", "summary": "Misinformation is an ever increasing problem that is difficult to solve for\nthe research community and has a negative impact on the society at large. Very\nrecently, the problem has been addressed with a crowdsourcing-based approach to\nscale up labeling efforts: to assess the truthfulness of a statement, instead\nof relying on a few experts, a crowd of (non-expert) judges is exploited. We\nfollow the same approach to study whether crowdsourcing is an effective and\nreliable method to assess statements truthfulness during a pandemic. We\nspecifically target statements related to the COVID-19 health emergency, that\nis still ongoing at the time of the study and has arguably caused an increase\nof the amount of misinformation that is spreading online (a phenomenon for\nwhich the term \"infodemic\" has been used). By doing so, we are able to address\n(mis)information that is both related to a sensitive and personal issue like\nhealth and very recent as compared to when the judgment is done: two issues\nthat have not been analyzed in related work. In our experiment, crowd workers\nare asked to assess the truthfulness of statements, as well as to provide\nevidence for the assessments as a URL and a text justification. Besides showing\nthat the crowd is able to accurately judge the truthfulness of the statements,\nwe also report results on many different aspects, including: agreement among\nworkers, the effect of different aggregation functions, of scales\ntransformations, and of workers background / bias. We also analyze workers\nbehavior, in terms of queries submitted, URLs found / selected, text\njustifications, and other behavioral data like clicks and mouse actions\ncollected by means of an ad hoc logger.", "author": [{"name": "Kevin Roitero"}, {"name": "Michael Soprano"}, {"name": "Beatrice Portelli"}, {"name": "Damiano Spina"}, {"name": "Vincenzo Della Mea"}, {"name": "Giuseppe Serra"}, {"name": "Stefano Mizzaro"}, {"name": "Gianluca Demartini"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1145/3340531.3412048"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1145/3340531.3412048", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2008.05701v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2008.05701v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10 pages; Preprint of the full paper accepted at CIKM 2020"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68P20", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "H.3", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2003.00923v1", "updated": "2020-03-02T14:07:56Z", "published": "2020-03-02T14:07:56Z", "title": "Advertisers Jump on Coronavirus Bandwagon: Politics, News, and Business", "summary": "In the age of social media, disasters and epidemics usher not only a\ndevastation and affliction in the physical world, but also prompt a deluge of\ninformation, opinions, prognoses and advice to billions of internet users. The\ncoronavirus epidemic of 2019-2020, or COVID-19, is no exception, with the World\nHealth Organization warning of a possible \"infodemic\" of fake news. In this\nstudy, we examine the alternative narratives around the coronavirus outbreak\nthrough advertisements promoted on Facebook, the largest social media platform\nin the US. Using the new Facebook Ads Library, we discover advertisers from\npublic health and non-profit sectors, alongside those from news media,\npolitics, and business, incorporating coronavirus into their messaging and\nagenda. We find the virus used in political attacks, donation solicitations,\nbusiness promotion, stock market advice, and animal rights campaigning. Among\nthese, we find several instances of possible misinformation, ranging from\nbioweapons conspiracy theories to unverifiable claims by politicians. As we\nmake the dataset available to the community, we hope the advertising domain\nwill become an important part of quality control for public health\ncommunication and public discourse in general.", "author": [{"name": "Yelena Mejova"}, {"name": "Kyriaki Kalimeri"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Preprint. Under Review"}, "link": [{"@href": "http://arxiv.org/abs/2003.00923v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2003.00923v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2003.05004v1", "updated": "2020-03-10T21:14:17Z", "published": "2020-03-10T21:14:17Z", "title": "The COVID-19 Social Media Infodemic", "summary": "We address the diffusion of information about the COVID-19 with a massive\ndata analysis on Twitter, Instagram, YouTube, Reddit and Gab. We analyze\nengagement and interest in the COVID-19 topic and provide a differential\nassessment on the evolution of the discourse on a global scale for each\nplatform and their users. We fit information spreading with epidemic models\ncharacterizing the basic reproduction numbers $R_0$ for each social media\nplatform. Moreover, we characterize information spreading from questionable\nsources, finding different volumes of misinformation in each platform. However,\ninformation from both reliable and questionable sources do not present\ndifferent spreading patterns. Finally, we provide platform-dependent numerical\nestimates of rumors' amplification.", "author": [{"name": "Matteo Cinelli"}, {"name": "Walter Quattrociocchi"}, {"name": "Alessandro Galeazzi"}, {"name": "Carlo Michele Valensise"}, {"name": "Emanuele Brugnoli"}, {"name": "Ana Lucia Schmidt"}, {"name": "Paola Zola"}, {"name": "Fabiana Zollo"}, {"name": "Antonio Scala"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1038/s41598-020-73510-5"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1038/s41598-020-73510-5", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2003.05004v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2003.05004v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Sci Rep 10, 16598 (2020)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "nlin.AO", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2004.03997v2", "updated": "2020-04-11T14:28:32Z", "published": "2020-04-08T14:03:20Z", "title": "Assessing the risks of \"infodemics\" in response to COVID-19 epidemics", "summary": "Our society is built on a complex web of interdependencies whose effects\nbecome manifest during extraordinary events such as the COVID-19 pandemic, with\nshocks in one system propagating to the others to an exceptional extent. We\nanalyzed more than 100 millions Twitter messages posted worldwide in 64\nlanguages during the epidemic emergency due to SARS-CoV-2 and classified the\nreliability of news diffused. We found that waves of unreliable and low-quality\ninformation anticipate the epidemic ones, exposing entire countries to\nirrational social behavior and serious threats for public health. When the\nepidemics hit the same area, reliable information is quickly inoculated, like\nantibodies, and the system shifts focus towards certified informational\nsources. Contrary to mainstream beliefs, we show that human response to\nfalsehood exhibits early-warning signals that might be mitigated with adequate\ncommunication strategies.", "author": [{"name": "Riccardo Gallotti"}, {"name": "Francesco Valle"}, {"name": "Nicola Castaldo"}, {"name": "Pierluigi Sacco"}, {"name": "Manlio De Domenico"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1038/s41562-020-00994-6"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1038/s41562-020-00994-6", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2004.03997v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2004.03997v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "The dataset analyzed in this paper can be interactively visualized\n  and accessed at https://covid19obs.fbk.eu/"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Nat Hum Behav (2020)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2004.08917v1", "updated": "2020-04-19T17:26:50Z", "published": "2020-04-19T17:26:50Z", "title": "On the dynamics emerging from pandemics and infodemics", "summary": "This position paper discusses emerging behavioral, social, and economic\ndynamics related to the COVID-19 pandemic and puts particular emphasis on two\nemerging issues: First, delayed effects (or second strikes) of pandemics caused\nby dread risk effects are discussed whereby two factors which might influence\nthe existence of such effects are identified, namely the accessibility of\n(mis-)information and the effects of policy decisions on adaptive behavior.\nSecond, the issue of individual preparedness to hazardous events is discussed.\nAs events such as the COVID-19 pandemic unfolds complex behavioral patterns\nwhich are hard to predict, sophisticated models which account for behavioral,\nsocial, and economic dynamics are required to assess the effectivity and\nefficiency of decision-making.", "author": {"name": "Stephan Leitner"}, "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1007/s11299-020-00256-y"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1007/s11299-020-00256-y", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2004.08917v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2004.08917v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "7 pages. Mind & Society (2020)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "econ.GN", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "math.DS", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "q-fin.EC", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "91C99 (Primary), 91E30, 91D30, 91B55", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2004.12226v1", "updated": "2020-04-25T20:07:54Z", "published": "2020-04-25T20:07:54Z", "title": "A First Instagram Dataset on COVID-19", "summary": "The novel coronavirus (COVID-19) pandemic outbreak is drastically shaping and\nreshaping many aspects of our life, with a huge impact on our social life. In\nthis era of lockdown policies in most of the major cities around the world, we\nsee a huge increase in people and professional engagement in social media.\nSocial media is playing an important role in news propagation as well as\nkeeping people in contact. At the same time, this source is both a blessing and\na curse as the coronavirus infodemic has become a major concern, and is already\na topic that needs special attention and further research. In this paper, we\nprovide a multilingual coronavirus (COVID-19) Instagram dataset that we have\nbeen continuously collected since March 30, 2020. We are making our dataset\navailable to the research community at Github. We believe that this\ncontribution will help the community to better understand the dynamics behind\nthis phenomenon in Instagram, as one of the major social media. This dataset\ncould also help study the propagation of misinformation related to this\noutbreak.", "author": [{"name": "Koosha Zarei"}, {"name": "Reza Farahbakhsh"}, {"name": "Noel Crespi"}, {"name": "Gareth Tyson"}], "link": [{"@href": "http://arxiv.org/abs/2004.12226v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2004.12226v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2005.10414v1", "updated": "2020-05-21T01:34:08Z", "published": "2020-05-21T01:34:08Z", "title": "Analysis of misinformation during the COVID-19 outbreak in China:\n  cultural, social and political entanglements", "summary": "COVID-19 resulted in an infodemic, which could erode public trust, impede\nvirus containment, and outlive the pandemic itself. The evolving and fragmented\nmedia landscape is a key driver of the spread of misinformation. Using\nmisinformation identified by the fact-checking platform by Tencent and posts on\nWeibo, our results showed that the evolution of misinformation follows an\nissue-attention cycle, pertaining to topics such as city lockdown, cures, and\npreventions, and school reopening. Sources of authority weigh in on these\ntopics, but their influence is complicated by peoples' pre-existing beliefs and\ncultural practices. Finally, social media has a complicated relationship with\nestablished or legacy media systems. Sometimes they reinforce each other, but\nin general, social media may have a topic cycle of its own making. Our findings\nshed light on the distinct characteristics of misinformation during the\nCOVID-19 and offer insights into combating misinformation in China and across\nthe world at large.", "author": [{"name": "Yan Leng"}, {"name": "Yujia Zhai"}, {"name": "Shaojing Sun"}, {"name": "Yifei Wu"}, {"name": "Jordan Selzer"}, {"name": "Sharon Strover"}, {"name": "Julia Fensel"}, {"name": "Alex Pentland"}, {"name": "Ying Ding"}], "link": [{"@href": "http://arxiv.org/abs/2005.10414v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.10414v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2007.11302v1", "updated": "2020-07-22T09:43:43Z", "published": "2020-07-22T09:43:43Z", "title": "Information disorders on Italian Facebook during COVID-19 infodemic", "summary": "In this work we carry out an exploratory analysis of online conversations on\nthe Italian Facebook during the recent COVID-19 pandemic. We analyze the\ncirculation of controversial topics associated with the origin of the virus,\nwhich involve popular targets of misinformation, such as migrants and 5G\ntechnology. We collected over 1.5 M posts in Italian language and related to\nCOVID-19, shared by nearly 80k public pages and groups for a period of four\nmonths since January 2020. Overall, we find that potentially harmful content\nshared by unreliable sources is substantially negligible compared to\ntraditional news websites, and that discussions over controversial topics has a\nlimited engagement w.r.t to the pandemic in general. Besides, we highlight a\n\"small-worldness\" effect in the URL sharing diffusion network, indicating that\nusers navigating through a limited set of pages could reach almost the entire\npool of shared content related to the pandemic, thus being easily exposed to\nharmful propaganda as well as to verified information on the virus.", "author": [{"name": "Alessandro Celestini"}, {"name": "Marco Di Giovanni"}, {"name": "Stefano Guarino"}, {"name": "Francesco Pierri"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1016/j.osnem.2021.100124"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1016/j.osnem.2021.100124", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2007.11302v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2007.11302v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "16 pages, 13 figures, 7 tables"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2008.04374v1", "updated": "2020-08-10T19:21:06Z", "published": "2020-08-10T19:21:06Z", "title": "Can We Spot the \"Fake News\" Before It Was Even Written?", "summary": "Given the recent proliferation of disinformation online, there has been also\ngrowing research interest in automatically debunking rumors, false claims, and\n\"fake news.\" A number of fact-checking initiatives have been launched so far,\nboth manual and automatic, but the whole enterprise remains in a state of\ncrisis: by the time a claim is finally fact-checked, it could have reached\nmillions of users, and the harm caused could hardly be undone. An arguably more\npromising direction is to focus on fact-checking entire news outlets, which can\nbe done in advance. Then, we could fact-check the news before it was even\nwritten: by checking how trustworthy the outlets that published it is. We\ndescribe how we do this in the Tanbih news aggregator, which makes readers\naware of what they are reading. In particular, we develop media profiles that\nshow the general factuality of reporting, the degree of propagandistic content,\nhyper-partisanship, leading political ideology, general frame of reporting, and\nstance with respect to various claims and topics.", "author": {"name": "Preslav Nakov"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Fake News, Disinformation, Media Bias, Propaganda, Infodemic,\n  COVID-19"}, "link": [{"@href": "http://arxiv.org/abs/2008.04374v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2008.04374v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T50", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2.7", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2010.09113v1", "updated": "2020-10-18T21:44:23Z", "published": "2020-10-18T21:44:23Z", "title": "Disinformation in the Online Information Ecosystem: Detection,\n  Mitigation and Challenges", "summary": "With the rapid increase in access to internet and the subsequent growth in\nthe population of online social media users, the quality of information posted,\ndisseminated and consumed via these platforms is an issue of growing concern. A\nlarge fraction of the common public turn to social media platforms and in\ngeneral the internet for news and even information regarding highly concerning\nissues such as COVID-19 symptoms. Given that the online information ecosystem\nis extremely noisy, fraught with misinformation and disinformation, and often\ncontaminated by malicious agents spreading propaganda, identifying genuine and\ngood quality information from disinformation is a challenging task for humans.\nIn this regard, there is a significant amount of ongoing research in the\ndirections of disinformation detection and mitigation. In this survey, we\ndiscuss the online disinformation problem, focusing on the recent 'infodemic'\nin the wake of the coronavirus pandemic. We then proceed to discuss the\ninherent challenges in disinformation research, and then elaborate on the\ncomputational and interdisciplinary approaches towards mitigation of\ndisinformation, after a short overview of the various directions explored in\ndetection efforts.", "author": [{"name": "Amrita Bhattacharjee"}, {"name": "Kai Shu"}, {"name": "Min Gao"}, {"name": "Huan Liu"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "A Chinese version of this manuscript has been submitted to the\n  Journal of Computer Research and Development"}, "link": [{"@href": "http://arxiv.org/abs/2010.09113v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2010.09113v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2010.16357v1", "updated": "2020-10-30T16:26:35Z", "published": "2020-10-30T16:26:35Z", "title": "A Cross-lingual Natural Language Processing Framework for Infodemic\n  Management", "summary": "The COVID-19 pandemic has put immense pressure on health systems which are\nfurther strained due to the misinformation surrounding it. Under such a\nsituation, providing the right information at the right time is crucial. There\nis a growing demand for the management of information spread using Artificial\nIntelligence. Hence, we have exploited the potential of Natural Language\nProcessing for identifying relevant information that needs to be disseminated\namongst the masses. In this work, we present a novel Cross-lingual Natural\nLanguage Processing framework to provide relevant information by matching daily\nnews with trusted guidelines from the World Health Organization. The proposed\npipeline deploys various techniques of NLP such as summarizers, word\nembeddings, and similarity metrics to provide users with news articles along\nwith a corresponding healthcare guideline. A total of 36 models were evaluated\nand a combination of LexRank based summarizer on Word2Vec embedding with Word\nMover distance metric outperformed all other models. This novel open-source\napproach can be used as a template for proactive dissemination of relevant\nhealthcare information in the midst of misinformation spread associated with\nepidemics.", "author": [{"name": "Ridam Pal"}, {"name": "Rohan Pandey"}, {"name": "Vaibhav Gautam"}, {"name": "Kanav Bhagat"}, {"name": "Tavpritesh Sethi"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "8 Pages, 2 Figures, 3 Tables"}, "link": [{"@href": "http://arxiv.org/abs/2010.16357v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2010.16357v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2011.09145v2", "updated": "2020-11-19T05:45:58Z", "published": "2020-11-18T07:56:24Z", "title": "A First Look at COVID-19 Messages on WhatsApp in Pakistan", "summary": "The worldwide spread of COVID-19 has prompted extensive online discussions,\ncreating an `infodemic' on social media platforms such as WhatsApp and Twitter.\nHowever, the information shared on these platforms is prone to be unreliable\nand/or misleading. In this paper, we present the first analysis of COVID-19\ndiscourse on public WhatsApp groups from Pakistan. Building on a large scale\nannotation of thousands of messages containing text and images, we identify the\nmain categories of discussion. We focus on COVID-19 messages and understand the\ndifferent types of images/text messages being propagated. By exploring user\nbehavior related to COVID messages, we inspect how misinformation is spread.\nFinally, by quantifying the flow of information across WhatsApp and Twitter, we\nshow how information spreads across platforms and how WhatsApp acts as a source\nfor much of the information shared on Twitter.", "author": [{"name": "R. Tallal Javed"}, {"name": "Mirza Elaaf Shuja"}, {"name": "Muhammad Usama"}, {"name": "Junaid Qadir"}, {"name": "Waleed Iqbal"}, {"name": "Gareth Tyson"}, {"name": "Ignacio Castro"}, {"name": "Kiran Garimella"}], "link": [{"@href": "http://arxiv.org/abs/2011.09145v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2011.09145v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2012.07088v4", "updated": "2021-08-12T08:55:47Z", "published": "2020-12-13T16:12:28Z", "title": "From #Jobsearch to #Mask: Improving COVID-19 Cascade Prediction with\n  Spillover Effects", "summary": "An information outbreak occurs on social media along with the COVID-19\npandemic and leads to infodemic. Predicting the popularity of online content,\nknown as cascade prediction, allows for not only catching in advance hot\ninformation that deserves attention, but also identifying false information\nthat will widely spread and require quick response to mitigate its impact.\nAmong the various information diffusion patterns leveraged in previous works,\nthe spillover effect of the information exposed to users on their decision to\nparticipate in diffusing certain information is still not studied. In this\npaper, we focus on the diffusion of information related to COVID-19 preventive\nmeasures. Through our collected Twitter dataset, we validated the existence of\nthis spillover effect. Building on the finding, we proposed extensions to three\ncascade prediction methods based on Graph Neural Networks (GNNs). Experiments\nconducted on our dataset demonstrated that the use of the identified spillover\neffect significantly improves the state-of-the-art GNNs methods in predicting\nthe popularity of not only preventive measure messages, but also other COVID-19\nrelated messages.", "author": [{"name": "Ninghan Chen"}, {"name": "Xihui Chen"}, {"name": "Zhiqiang Zhong"}, {"name": "Jun Pang"}], "link": [{"@href": "http://arxiv.org/abs/2012.07088v4", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2012.07088v4", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2101.03013v3", "updated": "2021-08-26T15:49:10Z", "published": "2021-01-08T13:59:26Z", "title": "Multistage BiCross encoder for multilingual access to COVID-19 health\n  information", "summary": "The Coronavirus (COVID-19) pandemic has led to a rapidly growing 'infodemic'\nof health information online. This has motivated the need for accurate semantic\nsearch and retrieval of reliable COVID-19 information across millions of\ndocuments, in multiple languages. To address this challenge, this paper\nproposes a novel high precision and high recall neural Multistage BiCross\nencoder approach. It is a sequential three-stage ranking pipeline which uses\nthe Okapi BM25 retrieval algorithm and transformer-based bi-encoder and\ncross-encoder to effectively rank the documents with respect to the given\nquery. We present experimental results from our participation in the\nMultilingual Information Access (MLIA) shared task on COVID-19 multilingual\nsemantic search. The independently evaluated MLIA results validate our approach\nand demonstrate that it outperforms other state-of-the-art approaches according\nto nearly all evaluation metrics in cases of both monolingual and bilingual\nruns.", "author": [{"name": "Iknoor Singh"}, {"name": "Carolina Scarton"}, {"name": "Kalina Bontcheva"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "PLOS ONE 2021"}, "link": [{"@href": "http://arxiv.org/abs/2101.03013v3", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2101.03013v3", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2101.12027v1", "updated": "2021-01-28T14:43:42Z", "published": "2021-01-28T14:43:42Z", "title": "A transformer based approach for fighting COVID-19 fake news", "summary": "The rapid outbreak of COVID-19 has caused humanity to come to a stand-still\nand brought with it a plethora of other problems. COVID-19 is the first\npandemic in history when humanity is the most technologically advanced and\nrelies heavily on social media platforms for connectivity and other benefits.\nUnfortunately, fake news and misinformation regarding this virus is also\navailable to people and causing some massive problems. So, fighting this\ninfodemic has become a significant challenge. We present our solution for the\n\"Constraint@AAAI2021 - COVID19 Fake News Detection in English\" challenge in\nthis work. After extensive experimentation with numerous architectures and\ntechniques, we use eight different transformer-based pre-trained models with\nadditional layers to construct a stacking ensemble classifier and fine-tuned\nthem for our purpose. We achieved 0.979906542 accuracy, 0.979913119 precision,\n0.979906542 recall, and 0.979907901 f1-score on the test dataset of the\ncompetition.", "author": [{"name": "S. M. Sadiq-Ur-Rahman Shifath"}, {"name": "Mohammad Faiyaz Khan"}, {"name": "Md. Saiful Islam"}], "link": [{"@href": "http://arxiv.org/abs/2101.12027v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2101.12027v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2104.04331v1", "updated": "2021-04-09T12:29:34Z", "published": "2021-04-09T12:29:34Z", "title": "The Burden of Being a Bridge: Understanding the Role of Multilingual\n  Users during the COVID-19 Pandemic", "summary": "The outbreak of the COVID-19 pandemic triggers infodemic over online social\nnetworks. It is thus important for governments to ensure their official\nmessages outpace misinformation and efficiently reach the public. Some\ncountries and regions that are currently worst affected by the virus including\nEurope, South America and India, encounter an additional difficulty:\nmultilingualism. Understanding the specific role of multilingual users in the\nprocess of information diffusion is critical to adjust their publishing\nstrategies for the governments of such countries and regions. In this paper, we\ninvestigate the role of multilingual users in diffusing information during the\nCOVID-19 pandemic on popular social networks. We collect a large-scale dataset\nof Twitter from a populated multilingual region from the beginning of the\npandemic. With this dataset, we successfully show that multilingual users act\nas bridges in diffusing COVID-19 related information. We further study the\nmental health of multilingual users and show that being the bridges,\nmultilingual users tend to be more negative. This is confirmed by a recent\npsychological study stating that excessive exposure to social media may result\nin a negative mood.", "author": [{"name": "Ninghan Chen"}, {"name": "Xihui Chen"}, {"name": "Zhiqiang Zhong"}, {"name": "Jun Pang"}], "link": [{"@href": "http://arxiv.org/abs/2104.04331v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2104.04331v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2105.03143v1", "updated": "2021-05-07T09:52:44Z", "published": "2021-05-07T09:52:44Z", "title": "AraCOVID19-MFH: Arabic COVID-19 Multi-label Fake News and Hate Speech\n  Detection Dataset", "summary": "Along with the COVID-19 pandemic, an \"infodemic\" of false and misleading\ninformation has emerged and has complicated the COVID-19 response efforts.\nSocial networking sites such as Facebook and Twitter have contributed largely\nto the spread of rumors, conspiracy theories, hate, xenophobia, racism, and\nprejudice. To combat the spread of fake news, researchers around the world have\nand are still making considerable efforts to build and share COVID-19 related\nresearch articles, models, and datasets. This paper releases \"AraCOVID19-MFH\" a\nmanually annotated multi-label Arabic COVID-19 fake news and hate speech\ndetection dataset. Our dataset contains 10,828 Arabic tweets annotated with 10\ndifferent labels. The labels have been designed to consider some aspects\nrelevant to the fact-checking task, such as the tweet's check worthiness,\npositivity/negativity, and factuality. To confirm our annotated dataset's\npractical utility, we used it to train and evaluate several classification\nmodels and reported the obtained results. Though the dataset is mainly designed\nfor fake news detection, it can also be used for hate speech detection,\nopinion/news classification, dialect identification, and many other tasks.", "author": [{"name": "Mohamed Seghir Hadj Ameur"}, {"name": "Hassina Aliane"}], "link": [{"@href": "http://arxiv.org/abs/2105.03143v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2105.03143v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T50", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2.7", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2105.07730v1", "updated": "2021-05-17T10:58:35Z", "published": "2021-05-17T10:58:35Z", "title": "The State of Infodemic on Twitter", "summary": "Following the wave of misinterpreted, manipulated and malicious information\ngrowing on the Internet, the misinformation surrounding COVID-19 has become a\nparamount issue. In the context of the current COVID-19 pandemic, social media\nposts and platforms are at risk of rumors and misinformation in the face of the\nserious uncertainty surrounding the virus itself. At the same time, the\nuncertainty and new nature of COVID-19 means that other unconfirmed information\nthat may appear \"rumored\" may be an important indicator of the behavior and\nimpact of this new virus. Twitter, in particular, has taken a center stage in\nthis storm where Covid-19 has been a much talked about subject. We have\npresented an exploratory analysis of the tweets and the users who are involved\nin spreading misinformation and then delved into machine learning models and\nnatural language processing techniques to identify if a tweet contains\nmisinformation.", "author": [{"name": "Drishti Jain", "arxiv:affiliation": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Indraprastha Institute of Information Technology"}}, {"name": "Tavpritesh Sethi", "arxiv:affiliation": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Indraprastha Institute of Information Technology"}}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "8 pages"}, "link": [{"@href": "http://arxiv.org/abs/2105.07730v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2105.07730v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2106.11702v4", "updated": "2021-07-08T08:39:43Z", "published": "2021-06-22T12:17:53Z", "title": "Categorising Fine-to-Coarse Grained Misinformation: An Empirical Study\n  of COVID-19 Infodemic", "summary": "The spreading COVID-19 misinformation over social media already draws the\nattention of many researchers. According to Google Scholar, about 26000\nCOVID-19 related misinformation studies have been published to date. Most of\nthese studies focusing on 1) detect and/or 2) analysing the characteristics of\nCOVID-19 related misinformation. However, the study of the social behaviours\nrelated to misinformation is often neglected. In this paper, we introduce a\nfine-grained annotated misinformation tweets dataset including social\nbehaviours annotation (e.g. comment or question to the misinformation). The\ndataset not only allows social behaviours analysis but also suitable for both\nevidence-based or non-evidence-based misinformation classification task. In\naddition, we introduce leave claim out validation in our experiments and\ndemonstrate the misinformation classification performance could be\nsignificantly different when applying to real-world unseen misinformation.", "author": [{"name": "Ye Jiang"}, {"name": "Xingyi Song"}, {"name": "Carolina Scarton"}, {"name": "Ahmet Aker"}, {"name": "Kalina Bontcheva"}], "link": [{"@href": "http://arxiv.org/abs/2106.11702v4", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2106.11702v4", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2107.05016v1", "updated": "2021-07-11T10:42:58Z", "published": "2021-07-11T10:42:58Z", "title": "Combating fake news by empowering fact-checked news spread via\n  topology-based interventions", "summary": "Rapid information diffusion and large-scaled information cascades can enable\nthe undesired spread of false information. A small-scaled false information\noutbreak may potentially lead to an infodemic. We propose a novel information\ndiffusion and intervention technique to combat the spread of false news. As\nfalse information is often spreading faster in a social network, the proposed\ndiffusion methodology inhibits the spread of false news by proactively\ndiffusing the fact-checked information. Our methodology mainly relies on\ndefining the potential super-spreaders in a social network based on their\ncentrality metrics. We run an extensive set of experiments on different\nnetworks to investigate the impact of centrality metrics on the performance of\nthe proposed diffusion and intervention models. The obtained results\ndemonstrate that empowering the diffusion of fact-checked news combats the\nspread of false news further and deeper in social networks.", "author": [{"name": "Ke Wang"}, {"name": "Waheeb Yaqub"}, {"name": "Abdallah Lakhdari"}, {"name": "Basem Suleiman"}], "link": [{"@href": "http://arxiv.org/abs/2107.05016v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.05016v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.HC", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2107.10648v1", "updated": "2021-07-04T07:09:59Z", "published": "2021-07-04T07:09:59Z", "title": "DEAP-FAKED: Knowledge Graph based Approach for Fake News Detection", "summary": "Fake News on social media platforms has attracted a lot of attention in\nrecent times, primarily for events related to politics (2016 US Presidential\nelections), healthcare (infodemic during COVID-19), to name a few. Various\nmethods have been proposed for detecting Fake News. The approaches span from\nexploiting techniques related to network analysis, Natural Language Processing\n(NLP), and the usage of Graph Neural Networks (GNNs). In this work, we propose\nDEAP-FAKED, a knowleDgE grAPh FAKe nEws Detection framework for identifying\nFake News. Our approach is a combination of the NLP -- where we encode the news\ncontent, and the GNN technique -- where we encode the Knowledge Graph (KG). A\nvariety of these encodings provides a complementary advantage to our detector.\nWe evaluate our framework using two publicly available datasets containing\narticles from domains such as politics, business, technology, and healthcare.\nAs part of dataset pre-processing, we also remove the bias, such as the source\nof the articles, which could impact the performance of the models. DEAP-FAKED\nobtains an F1-score of 88% and 78% for the two datasets, which is an\nimprovement of 21%, and 3% respectively, which shows the effectiveness of the\napproach.", "author": [{"name": "Mohit Mayank"}, {"name": "Shakshi Sharma"}, {"name": "Rajesh Sharma"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "8"}, "link": [{"@href": "http://arxiv.org/abs/2107.10648v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.10648v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2107.12303v2", "updated": "2021-08-04T18:59:47Z", "published": "2021-07-26T16:20:44Z", "title": "The False COVID-19 Narratives That Keep Being Debunked: A Spatiotemporal\n  Analysis", "summary": "The onset of the Coronavirus disease 2019 (COVID-19) pandemic instigated a\nglobal infodemic that has brought unprecedented challenges for society as a\nwhole. During this time, a number of manual fact-checking initiatives have\nemerged to alleviate the spread of dis/mis-information. This study is about\nCOVID-19 debunks published in multiple languages by different fact-checking\norganisations, sometimes as far as several months apart, despite the fact that\nthe claim has already been fact-checked before. The spatiotemporal analysis\nreveals that similar or nearly duplicate false COVID-19 narratives have been\nspreading in multifarious modalities on various social media platforms in\ndifferent countries. We also find that misinformation involving general medical\nadvice has spread across multiple countries and hence has the highest\nproportion of false COVID-19 narratives that keep being debunked. Furthermore,\nas manual fact-checking is an onerous task in itself, therefore debunking\nsimilar claims recurrently is leading to a waste of resources. To this end, we\npropound the idea of the inclusion of multilingual debunk search in the\nfact-checking pipeline.", "author": [{"name": "Iknoor Singh"}, {"name": "Kalina Bontcheva"}, {"name": "Carolina Scarton"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Under Review"}, "link": [{"@href": "http://arxiv.org/abs/2107.12303v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.12303v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2003.11336v3", "updated": "2021-01-11T14:35:21Z", "published": "2020-03-25T12:30:33Z", "title": "Mapping the Landscape of Artificial Intelligence Applications against\n  COVID-19", "summary": "COVID-19, the disease caused by the SARS-CoV-2 virus, has been declared a\npandemic by the World Health Organization, which has reported over 18 million\nconfirmed cases as of August 5, 2020. In this review, we present an overview of\nrecent studies using Machine Learning and, more broadly, Artificial\nIntelligence, to tackle many aspects of the COVID-19 crisis. We have identified\napplications that address challenges posed by COVID-19 at different scales,\nincluding: molecular, by identifying new or existing drugs for treatment;\nclinical, by supporting diagnosis and evaluating prognosis based on medical\nimaging and non-invasive measures; and societal, by tracking both the epidemic\nand the accompanying infodemic using multiple data sources. We also review\ndatasets, tools, and resources needed to facilitate Artificial Intelligence\nresearch, and discuss strategic considerations related to the operational\nimplementation of multidisciplinary partnerships and open science. We highlight\nthe need for international cooperation to maximize the potential of AI in this\nand future pandemics.", "author": [{"name": "Joseph Bullock"}, {"name": "Alexandra Luccioni"}, {"name": "Katherine Hoffmann Pham"}, {"name": "Cynthia Sin Nga Lam"}, {"name": "Miguel Luengo-Oroz"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1613/jair.1.12162"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1613/jair.1.12162", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2003.11336v3", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2003.11336v3", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "39 pages, v2: much larger to reflect the significant increase in the\n  size of the body of literature, v3: uploaded with JAIR page numbers and\n  references"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Journal of Artificial Intelligence Research 69 (2020) 807-845"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2005.05710v2", "updated": "2020-08-24T19:13:30Z", "published": "2020-05-12T12:07:35Z", "title": "An Exploratory Study of COVID-19 Misinformation on Twitter", "summary": "During the COVID-19 pandemic, social media has become a home ground for\nmisinformation. To tackle this infodemic, scientific oversight, as well as a\nbetter understanding by practitioners in crisis management, is needed. We have\nconducted an exploratory study into the propagation, authors and content of\nmisinformation on Twitter around the topic of COVID-19 in order to gain early\ninsights. We have collected all tweets mentioned in the verdicts of\nfact-checked claims related to COVID-19 by over 92 professional fact-checking\norganisations between January and mid-July 2020 and share this corpus with the\ncommunity. This resulted in 1 500 tweets relating to 1 274 false and 276\npartially false claims, respectively. Exploratory analysis of author accounts\nrevealed that the verified twitter handle(including Organisation/celebrity) are\nalso involved in either creating (new tweets) or spreading (retweet) the\nmisinformation. Additionally, we found that false claims propagate faster than\npartially false claims. Compare to a background corpus of COVID-19 tweets,\ntweets with misinformation are more often concerned with discrediting other\ninformation on social media. Authors use less tentative language and appear to\nbe more driven by concerns of potential harm to others. Our results enable us\nto suggest gaps in the current scientific coverage of the topic as well as\npropose actions for authorities and social media users to counter\nmisinformation.", "author": [{"name": "Gautam Kishore Shahi"}, {"name": "Anne Dirkson"}, {"name": "Tim A. Majchrzak"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "20 pages, nine figures, four tables. Submitted for peer review,\n  revision 1"}, "link": [{"@href": "http://arxiv.org/abs/2005.05710v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.05710v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2005.05854v1", "updated": "2020-05-12T15:20:55Z", "published": "2020-05-12T15:20:55Z", "title": "Prta: A System to Support the Analysis of Propaganda Techniques in the\n  News", "summary": "Recent events, such as the 2016 US Presidential Campaign, Brexit and the\nCOVID-19 \"infodemic\", have brought into the spotlight the dangers of online\ndisinformation. There has been a lot of research focusing on fact-checking and\ndisinformation detection. However, little attention has been paid to the\nspecific rhetorical and psychological techniques used to convey propaganda\nmessages. Revealing the use of such techniques can help promote media literacy\nand critical thinking, and eventually contribute to limiting the impact of\n\"fake news\" and disinformation campaigns. Prta (Propaganda Persuasion\nTechniques Analyzer) allows users to explore the articles crawled on a regular\nbasis by highlighting the spans in which propaganda techniques occur and to\ncompare them on the basis of their use of propaganda techniques. The system\nfurther reports statistics about the use of such techniques, overall and over\ntime, or according to filtering criteria specified by the user based on time\ninterval, keywords, and/or political orientation of the media. Moreover, it\nallows users to analyze any text or URL through a dedicated interface or via an\nAPI. The system is available online: https://www.tanbih.org/prta", "author": [{"name": "Giovanni Da San Martino"}, {"name": "Shaden Shaar"}, {"name": "Yifan Zhang"}, {"name": "Seunghak Yu"}, {"name": "Alberto Barrón-Cedeño"}, {"name": "Preslav Nakov"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "propaganda, disinformation, fake news, media bias, COVID-19"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "ACL-2020"}, "link": [{"@href": "http://arxiv.org/abs/2005.05854v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2005.05854v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.NE", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T50", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2.7", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2006.05557v2", "updated": "2020-08-17T20:54:46Z", "published": "2020-06-09T23:40:51Z", "title": "ReCOVery: A Multimodal Repository for COVID-19 News Credibility Research", "summary": "First identified in Wuhan, China, in December 2019, the outbreak of COVID-19\nhas been declared as a global emergency in January, and a pandemic in March\n2020 by the World Health Organization (WHO). Along with this pandemic, we are\nalso experiencing an \"infodemic\" of information with low credibility such as\nfake news and conspiracies. In this work, we present ReCOVery, a repository\ndesigned and constructed to facilitate research on combating such information\nregarding COVID-19. We first broadly search and investigate ~2,000 news\npublishers, from which 60 are identified with extreme [high or low] levels of\ncredibility. By inheriting the credibility of the media on which they were\npublished, a total of 2,029 news articles on coronavirus, published from\nJanuary to May 2020, are collected in the repository, along with 140,820 tweets\nthat reveal how these news articles have spread on the Twitter social network.\nThe repository provides multimodal information of news articles on coronavirus,\nincluding textual, visual, temporal, and network information. The way that news\ncredibility is obtained allows a trade-off between dataset scalability and\nlabel accuracy. Extensive experiments are conducted to present data statistics\nand distributions, as well as to provide baseline performances for predicting\nnews credibility so that future methods can be compared. Our repository is\navailable at http://coronavirus-fakenews.com.", "author": [{"name": "Xinyi Zhou"}, {"name": "Apurva Mulay"}, {"name": "Emilio Ferrara"}, {"name": "Reza Zafarani"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1145/3340531.3412880"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1145/3340531.3412880", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2006.05557v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2006.05557v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Proceedings of the 29th ACM International Conference on Information\n  and Knowledge Management (CIKM '20)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2007.09703v1", "updated": "2020-07-19T16:14:58Z", "published": "2020-07-19T16:14:58Z", "title": "A curated collection of COVID-19 online datasets", "summary": "One of the defining moments of the year 2020 is the outbreak of Coronavirus\nDisease (Covid-19), a deadly virus affecting the body's respiratory system to\nthe point of needing a breathing aid via ventilators. As of June 21, 2020 there\nare 12,929,306 confirmed cases and 569,738 confirmed deaths across 216\ncountries, areas or territories. The scale of spread and impact of the pandemic\nleft many nations grappling with preventive and curative approaches. The\ninfamous lockdown measure introduced to mitigate the virus spread has altered\nmany aspects of our social routines in which demand for online-based services\nskyrocketed. As the virus propagate, so does misinformation and fake news\naround it via online social media, which seems to favour virality over\nveracity. With a majority of the populace confined to their homes for a long\nperiod, vulnerability to the toxic impact of online misinformation is high. A\ncase in point is the various myths and disinformation associated with the\nCovid-19, which, if left unchecked, could lead to a catastrophic outcome and\nhamper the fight against the virus.\n  While the scientific community is actively engaged in identifying the virus\ntreatment, there is a growing interest in combating the associated harmful\ninfodemic. To this end, researchers have been curating and documenting various\ndatasets about Covid-19. In line with existing studies, we provide an expansive\ncollection of curated datasets to support the fight against the pandemic,\nespecially concerning misinformation. The collection consists of 3 categories\nof Twitter data, information about standard practices from credible sources and\na chronicle of global situation reports. We describe how to retrieve the\nhydrated version of the data and proffer some research problems that could be\naddressed using the data.", "author": [{"name": "Isa Inuwa-Dutse"}, {"name": "Ioannis Korkontzelos"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10 pages, 7 figures"}, "link": [{"@href": "http://arxiv.org/abs/2007.09703v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2007.09703v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2012.07729v2", "updated": "2021-04-15T13:56:54Z", "published": "2020-12-14T17:24:59Z", "title": "\"Thought I'd Share First\" and Other Conspiracy Theory Tweets from the\n  COVID-19 Infodemic: Exploratory Study", "summary": "Background: The COVID-19 outbreak has left many people isolated within their\nhomes; these people are turning to social media for news and social connection,\nwhich leaves them vulnerable to believing and sharing misinformation.\nHealth-related misinformation threatens adherence to public health messaging,\nand monitoring its spread on social media is critical to understanding the\nevolution of ideas that have potentially negative public health impacts.\nResults: Analysis using model-labeled data was beneficial for increasing the\nproportion of data matching misinformation indicators. Random forest classifier\nmetrics varied across the four conspiracy theories considered (F1 scores\nbetween 0.347 and 0.857); this performance increased as the given conspiracy\ntheory was more narrowly defined. We showed that misinformation tweets\ndemonstrate more negative sentiment when compared to nonmisinformation tweets\nand that theories evolve over time, incorporating details from unrelated\nconspiracy theories as well as real-world events. Conclusions: Although we\nfocus here on health-related misinformation, this combination of approaches is\nnot specific to public health and is valuable for characterizing misinformation\nin general, which is an important first step in creating targeted messaging to\ncounteract its spread. Initial messaging should aim to preempt generalized\nmisinformation before it becomes widespread, while later messaging will need to\ntarget evolving conspiracy theories and the new facets of each as they become\nincorporated.", "author": [{"name": "Dax Gerts"}, {"name": "Courtney D. Shelley"}, {"name": "Nidhi Parikh"}, {"name": "Travis Pitts"}, {"name": "Chrysm Watson Ross"}, {"name": "Geoffrey Fairchild"}, {"name": "Nidia Yadria Vaquera Chavez"}, {"name": "Ashlynn R. Daughton"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.2196/26527"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.2196/26527", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2012.07729v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2012.07729v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "JMIR Pub Hlth Surv 2021 7(4)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "stat.ML", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2012.11004v1", "updated": "2020-12-20T19:35:25Z", "published": "2020-12-20T19:35:25Z", "title": "Fake news agenda in the era of COVID-19: Identifying trends through\n  fact-checking content", "summary": "The rise of social media has ignited an unprecedented circulation of false\ninformation in our society. It is even more evident in times of crises, such as\nthe COVID-19 pandemic. Fact-checking efforts have expanded greatly and have\nbeen touted as among the most promising solutions to fake news, especially in\ntimes like these. Several studies have reported the development of\nfact-checking organizations in Western societies, albeit little attention has\nbeen given to the Global South. Here, to fill this gap, we introduce a novel\nMarkov-inspired computational method for identifying topics in tweets. In\ncontrast to other topic modeling approaches, our method clusters topics and\ntheir current evolution in a predefined time window. Through these, we\ncollected data from Twitter accounts of two Brazilian fact-checking outlets and\npresented the topics debunked by these initiatives in fortnights throughout the\npandemic. By comparing these organizations, we could identify similarities and\ndifferences in what was shared by them. Our method resulted in an important\ntechnique to cluster topics in a wide range of scenarios, including an\ninfodemic -- a period overabundance of the same information. In particular, the\ndata clearly revealed a complex intertwining between politics and the health\ncrisis during this period. We conclude by proposing a generic model which, in\nour opinion, is suitable for topic modeling and an agenda for future research.", "author": [{"name": "Wilson Ceron"}, {"name": "Mathias-Felipe de-Lima-Santos"}, {"name": "Marcos G. Quiles"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1016/j.osnem.2020.100116"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1016/j.osnem.2020.100116", "@rel": "related"}, {"@href": "http://arxiv.org/abs/2012.11004v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2012.11004v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Online Social Networks and Media, 2020"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2103.00747v1", "updated": "2021-03-01T04:28:39Z", "published": "2021-03-01T04:28:39Z", "title": "Combat COVID-19 Infodemic Using Explainable Natural Language Processing\n  Models", "summary": "Misinformation of COVID-19 is prevalent on social media as the pandemic\nunfolds, and the associated risks are extremely high. Thus, it is critical to\ndetect and combat such misinformation. Recently, deep learning models using\nnatural language processing techniques, such as BERT (Bidirectional Encoder\nRepresentations from Transformers), have achieved great successes in detecting\nmisinformation. In this paper, we proposed an explainable natural language\nprocessing model based on DistilBERT and SHAP (Shapley Additive exPlanations)\nto combat misinformation about COVID-19 due to their efficiency and\neffectiveness. First, we collected a dataset of 984 claims about COVID-19 with\nfact checking. By augmenting the data using back-translation, we doubled the\nsample size of the dataset and the DistilBERT model was able to obtain good\nperformance (accuracy: 0.972; areas under the curve: 0.993) in detecting\nmisinformation about COVID-19. Our model was also tested on a larger dataset\nfor AAAI2021 - COVID-19 Fake News Detection Shared Task and obtained good\nperformance (accuracy: 0.938; areas under the curve: 0.985). The performance on\nboth datasets was better than traditional machine learning models. Second, in\norder to boost public trust in model prediction, we employed SHAP to improve\nmodel explainability, which was further evaluated using a between-subjects\nexperiment with three conditions, i.e., text (T), text+SHAP explanation (TSE),\nand text+SHAP explanation+source and evidence (TSESE). The participants were\nsignificantly more likely to trust and share information related to COVID-19 in\nthe TSE and TSESE conditions than in the T condition. Our results provided good\nimplications in detecting misinformation about COVID-19 and improving public\ntrust.", "author": [{"name": "Jackie Ayoub"}, {"name": "X. Jessie Yang"}, {"name": "Feng Zhou"}], "link": [{"@href": "http://arxiv.org/abs/2103.00747v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2103.00747v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2103.11804v2", "updated": "2021-06-05T20:42:13Z", "published": "2021-03-22T13:07:26Z", "title": "Detection of fake news on CoViD-19 on Web Search Engines", "summary": "In early January 2020, after China reported the first cases of the new\ncoronavirus (SARS-CoV-2) in the city of Wuhan, unreliable and not fully\naccurate information has started spreading faster than the virus itself.\nAlongside this pandemic, people have experienced a parallel infodemic, i.e., an\noverabundance of information, some of which misleading or even harmful, that\nhas widely spread around the globe. Although Social Media are increasingly\nbeing used as information source, Web Search Engines, like Google or Yahoo!,\nstill represent a powerful and trustworthy resource for finding information on\nthe Web. This is due to their capability to capture the largest amount of\ninformation, helping users quickly identify the most relevant, useful, although\nnot always the most reliable, results for their search queries. This study aims\nto detect potential misleading and fake contents by capturing and analysing\ntextual information, which flow through Search Engines. By using a real-world\ndataset associated with recent CoViD-19 pandemic, we first apply re-sampling\ntechniques for class imbalance, then we use existing Machine Learning\nalgorithms for classification of not reliable news. By extracting lexical and\nhost-based features of associated Uniform Resource Locators (URLs) for news\narticles, we show that the proposed methods, so common in phishing and\nmalicious URLs detection, can improve the efficiency and performance of\nclassifiers. Based on these findings, we suggest that the use of both textual\nand URLs features can improve the effectiveness of fake news detection methods.", "author": [{"name": "V. Mazzeo"}, {"name": "A. Rapisarda"}, {"name": "G. Giuffrida"}], "link": [{"@href": "http://arxiv.org/abs/2103.11804v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2103.11804v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2104.02752v1", "updated": "2021-04-06T19:23:44Z", "published": "2021-04-06T19:23:44Z", "title": "Multiscale Governance", "summary": "Future societal systems will be characterized by heterogeneous human\nbehaviors and also collective action. The interaction between local systems and\nglobal systems will be complex. Humandemics will propagate because of the\npathways that connect the different systems and several invariant behaviors and\npatterns that have emerged globally. On the contrary, infodemics of\nmisinformation can be a risk as it has occurred in the COVID-19 pandemic. The\nemerging fragility or robustness of the system will depend on how this complex\nnetwork of systems is governed. Future societal systems will not be only\nmultiscale in terms of the social dimension, but also in the temporality.\nNecessary and proper prevention and response systems based on complexity, ethic\nand multi-scale governance will be required. Real-time response systems are the\nbasis for resilience to be the foundation of robust societies. A top-down\napproach led by Governmental organs for managing humandemics is not sufficient\nand may be only effective if policies are very restrictive and their efficacy\ndepends not only in the measures implemented but also on the dynamics of the\npolicies and the population perception and compliance. This top-down approach\nis even weaker if there is not national and international coordination.\nCoordinating top-down agencies with bottom-up constructs will be the design\nprinciple. Multi-scale governance integrates decision-making processes with\nsignaling, sensing and leadership mechanisms to drive thriving societal systems\nwith real-time sensitivity.", "author": [{"name": "David Pastor-Escuredo"}, {"name": "Philip Treleaven"}], "link": [{"@href": "http://arxiv.org/abs/2104.02752v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2104.02752v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CC", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "econ.GN", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "q-fin.EC", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2104.03611v1", "updated": "2021-04-08T08:45:20Z", "published": "2021-04-08T08:45:20Z", "title": "Digital Epidemiology: A review", "summary": "The epidemiology has recently witnessed great advances based on computational\nmodels. Its scope and impact are getting wider thanks to the new data sources\nfeeding analytical frameworks and models. Besides traditional variables\nconsidered in epidemiology, large-scale social patterns can be now integrated\nin real time with multi-source data bridging the gap between different scales.\nIn a hyper-connected world, models and analysis of interactions and social\nbehaviors are key to understand and stop outbreaks. Big Data along with apps\nare enabling for validating and refining models with real world data at scale,\nas well as new applications and frameworks to map and track diseases in real\ntime or optimize the necessary resources and interventions such as testing and\nvaccination strategies. Digital epidemiology is positioning as a discipline\nnecessary to control epidemics and implement actionable protocols and policies.\nIn this review we address the research areas configuring current digital\nepidemiology: transmission and propagation models and descriptions based on\nhuman networks and contact tracing, mobility analysis and spatio-temporal\npropagation of infectious diseases and the emerging field of infodemics that\ncomprises the study of information and knowledge propagation related to\nepidemics. Digital epidemiology has the potential to create new operational\nmechanisms for prevention and mitigation, monitoring of the evolution of\nepidemics, assessing their impact and evaluating the pharmaceutical and\nnon-pharmaceutical measures to fight the outbreaks.", "author": {"name": "David Pastor-Escuredo"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "in Spanish"}, "link": [{"@href": "http://arxiv.org/abs/2104.03611v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2104.03611v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2106.06811v1", "updated": "2021-06-12T16:26:04Z", "published": "2021-06-12T16:26:04Z", "title": "Case Study on Detecting COVID-19 Health-Related Misinformation in Social\n  Media", "summary": "COVID-19 pandemic has generated what public health officials called an\ninfodemic of misinformation. As social distancing and stay-at-home orders came\ninto effect, many turned to social media for socializing. This increase in\nsocial media usage has made it a prime vehicle for the spreading of\nmisinformation. This paper presents a mechanism to detect COVID-19\nhealth-related misinformation in social media following an interdisciplinary\napproach. Leveraging social psychology as a foundation and existing\nmisinformation frameworks, we defined misinformation themes and associated\nkeywords incorporated into the misinformation detection mechanism using applied\nmachine learning techniques. Next, using the Twitter dataset, we explored the\nperformance of the proposed methodology using multiple state-of-the-art machine\nlearning classifiers. Our method shows promising results with at most 78%\naccuracy in classifying health-related misinformation versus true information\nusing uni-gram-based NLP feature generations from tweets and the Decision Tree\nclassifier. We also provide suggestions on alternatives for countering\nmisinformation and ethical consideration for the study.", "author": [{"name": "Mir Mehedi A. Pritom"}, {"name": "Rosana Montanez Rodriguez"}, {"name": "Asad Ali Khan"}, {"name": "Sebastian A. Nugroho"}, {"name": "Esra'a Alrashydah"}, {"name": "Beatrice N. Ruiz"}, {"name": "Anthony Rios"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10 pages"}, "link": [{"@href": "http://arxiv.org/abs/2106.06811v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2106.06811v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2107.09768v1", "updated": "2021-07-20T20:58:23Z", "published": "2021-07-20T20:58:23Z", "title": "Checkovid: A COVID-19 misinformation detection system on Twitter using\n  network and content mining perspectives", "summary": "During the COVID-19 pandemic, social media platforms were ideal for\ncommunicating due to social isolation and quarantine. Also, it was the primary\nsource of misinformation dissemination on a large scale, referred to as the\ninfodemic. Therefore, automatic debunking misinformation is a crucial problem.\nTo tackle this problem, we present two COVID-19 related misinformation datasets\non Twitter and propose a misinformation detection system comprising\nnetwork-based and content-based processes based on machine learning algorithms\nand NLP techniques. In the network-based process, we focus on social\nproperties, network characteristics, and users. On the other hand, we classify\nmisinformation using the content of the tweets directly in the content-based\nprocess, which contains text classification models (paragraph-level and\nsentence-level) and similarity models. The evaluation results on the\nnetwork-based process show the best results for the artificial neural network\nmodel with an F1 score of 88.68%. In the content-based process, our novel\nsimilarity models, which obtained an F1 score of 90.26%, show an improvement in\nthe misinformation classification results compared to the network-based models.\nIn addition, in the text classification models, the best result was achieved\nusing the stacking ensemble-learning model by obtaining an F1 score of 95.18%.\nFurthermore, we test our content-based models on the Constraint@AAAI2021\ndataset, and by getting an F1 score of 94.38%, we improve the baseline results.\nFinally, we develop a fact-checking website called Checkovid that uses each\nprocess to detect misinformative and informative claims in the domain of\nCOVID-19 from different perspectives.", "author": [{"name": "Sajad Dadgar"}, {"name": "Mehdi Ghatee"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "20 Pages, 18 Figures, 7 Tables, Submitted for Review Process in a\n  Journal"}, "link": [{"@href": "http://arxiv.org/abs/2107.09768v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.09768v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T05, 68T07", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "I.2; I.5", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2108.10735v1", "updated": "2021-08-16T17:02:18Z", "published": "2021-08-16T17:02:18Z", "title": "Misleading the Covid-19 vaccination discourse on Twitter: An exploratory\n  study of infodemic around the pandemic", "summary": "In this work, we collect a moderate-sized representative corpus of tweets\n(200,000 approx.) pertaining Covid-19 vaccination spanning over a period of\nseven months (September 2020 - March 2021). Following a Transfer Learning\napproach, we utilize the pre-trained Transformer-based XLNet model to classify\ntweets as Misleading or Non-Misleading and validate against a random subset of\nresults manually. We build on this to study and contrast the characteristics of\ntweets in the corpus that are misleading in nature against non-misleading ones.\nThis exploratory analysis enables us to design features (such as sentiments,\nhashtags, nouns, pronouns, etc) that can, in turn, be exploited for classifying\ntweets as (Non-)Misleading using various ML models in an explainable manner.\nSpecifically, several ML models are employed for prediction, with up to 90%\naccuracy, and the importance of each feature is explained using SHAP\nExplainable AI (XAI) tool. While the thrust of this work is principally\nexploratory analysis in order to obtain insights on the online discourse on\nCovid-19 vaccination, we conclude the paper by outlining how these insights\nprovide the foundations for a more actionable approach to mitigate\nmisinformation. The curated dataset and code is made available (Github\nrepository) so that the research community at large can reproduce, compare\nagainst, or build upon this work.", "author": [{"name": "Shakshi Sharma"}, {"name": "Rajesh Sharma"}, {"name": "Anwitaman Datta"}], "link": [{"@href": "http://arxiv.org/abs/2108.10735v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2108.10735v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2003.07074v3", "updated": "2020-10-30T15:49:04Z", "published": "2020-03-16T08:51:40Z", "title": "A Machine Learning Application for Raising WASH Awareness in the Times\n  of COVID-19 Pandemic", "summary": "Background: The COVID-19 pandemic has uncovered the potential of digital\nmisinformation in shaping the health of nations. The deluge of unverified\ninformation that spreads faster than the epidemic itself is an unprecedented\nphenomenon that has put millions of lives in danger. Mitigating this Infodemic\nrequires strong health messaging systems that are engaging, vernacular,\nscalable, effective and continuously learn the new patterns of misinformation.\n  Objective: We created WashKaro, a multi-pronged intervention for mitigating\nmisinformation through conversational AI, machine translation and natural\nlanguage processing. WashKaro provides the right information matched against\nWHO guidelines through AI, and delivers it in the right format in local\nlanguages.\n  Methods: We theorize (i) an NLP based AI engine that could continuously\nincorporate user feedback to improve relevance of information, (ii) bite sized\naudio in the local language to improve penetrance in a country with skewed\ngender literacy ratios, and (iii) conversational but interactive AI engagement\nwith users towards an increased health awareness in the community. Results: A\ntotal of 5026 people who downloaded the app during the study window, among\nthose 1545 were active users. Our study shows that 3.4 times more females\nengaged with the App in Hindi as compared to males, the relevance of\nAI-filtered news content doubled within 45 days of continuous machine learning,\nand the prudence of integrated AI chatbot Satya increased thus proving the\nusefulness of an mHealth platform to mitigate health misinformation.\n  Conclusion: We conclude that a multi-pronged machine learning application\ndelivering vernacular bite-sized audios and conversational AI is an effective\napproach to mitigate health misinformation.", "author": [{"name": "Rohan Pandey"}, {"name": "Vaibhav Gautam"}, {"name": "Ridam Pal"}, {"name": "Harsh Bandhey"}, {"name": "Lovedeep Singh Dhingra"}, {"name": "Himanshu Sharma"}, {"name": "Chirag Jain"}, {"name": "Kanav Bhagat"}, {"name": "Arushi"}, {"name": "Lajjaben Patel"}, {"name": "Mudit Agarwal"}, {"name": "Samprati Agrawal"}, {"name": "Rishabh Jalan"}, {"name": "Akshat Wadhwa"}, {"name": "Ayush Garg"}, {"name": "Vihaan Misra"}, {"name": "Yashwin Agrawal"}, {"name": "Bhavika Rana"}, {"name": "Ponnurangam Kumaraguru"}, {"name": "Tavpritesh Sethi"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "14 pages, 7 figures"}, "link": [{"@href": "http://arxiv.org/abs/2003.07074v3", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2003.07074v3", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2010.04377v1", "updated": "2020-10-09T05:43:08Z", "published": "2020-10-09T05:43:08Z", "title": "Hate is the New Infodemic: A Topic-aware Modeling of Hate Speech\n  Diffusion on Twitter", "summary": "Online hate speech, particularly over microblogging platforms like Twitter,\nhas emerged as arguably the most severe issue of the past decade. Several\ncountries have reported a steep rise in hate crimes infuriated by malicious\nhate campaigns. While the detection of hate speech is one of the emerging\nresearch areas, the generation and spread of topic-dependent hate in the\ninformation network remain under-explored. In this work, we focus on exploring\nuser behaviour, which triggers the genesis of hate speech on Twitter and how it\ndiffuses via retweets. We crawl a large-scale dataset of tweets, retweets, user\nactivity history, and follower networks, comprising over 161 million tweets\nfrom more than $41$ million unique users. We also collect over 600k\ncontemporary news articles published online. We characterize different signals\nof information that govern these dynamics. Our analyses differentiate the\ndiffusion dynamics in the presence of hate from usual information diffusion.\nThis motivates us to formulate the modelling problem in a topic-aware setting\nwith real-world knowledge. For predicting the initiation of hate speech for any\ngiven hashtag, we propose multiple feature-rich models, with the best\nperforming one achieving a macro F1 score of 0.65. Meanwhile, to predict the\nretweet dynamics on Twitter, we propose RETINA, a novel neural architecture\nthat incorporates exogenous influence using scaled dot-product attention.\nRETINA achieves a macro F1-score of 0.85, outperforming multiple\nstate-of-the-art models. Our analysis reveals the superlative power of RETINA\nto predict the retweet dynamics of hateful content compared to the existing\ndiffusion models.", "author": [{"name": "Sarah Masud"}, {"name": "Subhabrata Dutta"}, {"name": "Sakshi Makkar"}, {"name": "Chhavi Jain"}, {"name": "Vikram Goyal"}, {"name": "Amitava Das"}, {"name": "Tanmoy Chakraborty"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "6 table, 9 figures, Full paper in 37th International Conference on\n  Data Engineering (ICDE)"}, "link": [{"@href": "http://arxiv.org/abs/2010.04377v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2010.04377v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2011.05773v2", "updated": "2020-11-12T04:20:37Z", "published": "2020-11-11T13:48:44Z", "title": "The Role of the Crowd in Countering Misinformation: A Case Study of the\n  COVID-19 Infodemic", "summary": "Fact checking by professionals is viewed as a vital defense in the fight\nagainst misinformation.While fact checking is important and its impact has been\nsignificant, fact checks could have limited visibility and may not reach the\nintended audience, such as those deeply embedded in polarized communities.\nConcerned citizens (i.e., the crowd), who are users of the platforms where\nmisinformation appears, can play a crucial role in disseminating fact-checking\ninformation and in countering the spread of misinformation. To explore if this\nis the case, we conduct a data-driven study of misinformation on the Twitter\nplatform, focusing on tweets related to the COVID-19 pandemic, analyzing the\nspread of misinformation, professional fact checks, and the crowd response to\npopular misleading claims about COVID-19. In this work, we curate a dataset of\nfalse claims and statements that seek to challenge or refute them. We train a\nclassifier to create a novel dataset of 155,468 COVID-19-related tweets,\ncontaining 33,237 false claims and 33,413 refuting arguments.Our findings show\nthat professional fact-checking tweets have limited volume and reach. In\ncontrast, we observe that the surge in misinformation tweets results in a quick\nresponse and a corresponding increase in tweets that refute such\nmisinformation. More importantly, we find contrasting differences in the way\nthe crowd refutes tweets, some tweets appear to be opinions, while others\ncontain concrete evidence, such as a link to a reputed source. Our work\nprovides insights into how misinformation is organically countered in social\nplatforms by some of their users and the role they play in amplifying\nprofessional fact checks.These insights could lead to development of tools and\nmechanisms that can empower concerned citizens in combating misinformation. The\ncode and data can be found in\nhttp://claws.cc.gatech.edu/covid_counter_misinformation.html.", "author": [{"name": "Nicholas Micallef"}, {"name": "Bing He"}, {"name": "Srijan Kumar"}, {"name": "Mustaque Ahamad"}, {"name": "Nasir Memon"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "PrePrint - IEEE BigData 2020. The code and data can be found in\n  http://claws.cc.gatech.edu/covid_counter_misinformation.html"}, "link": [{"@href": "http://arxiv.org/abs/2011.05773v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2011.05773v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}]