[{"id": "http://arxiv.org/abs/1704.07506v1", "updated": "2017-04-25T01:20:40Z", "published": "2017-04-25T01:20:40Z", "title": "Some Like it Hoax: Automated Fake News Detection in Social Networks", "summary": "In recent years, the reliability of information on the Internet has emerged\nas a crucial issue of modern society. Social network sites (SNSs) have\nrevolutionized the way in which information is spread by allowing users to\nfreely share content. As a consequence, SNSs are also increasingly used as\nvectors for the diffusion of misinformation and hoaxes. The amount of\ndisseminated information and the rapidity of its diffusion make it practically\nimpossible to assess reliability in a timely manner, highlighting the need for\nautomatic hoax detection systems.\n  As a contribution towards this objective, we show that Facebook posts can be\nclassified with high accuracy as hoaxes or non-hoaxes on the basis of the users\nwho \"liked\" them. We present two classification techniques, one based on\nlogistic regression, the other on a novel adaptation of boolean crowdsourcing\nalgorithms. On a dataset consisting of 15,500 Facebook posts and 909,236 users,\nwe obtain classification accuracies exceeding 99% even when the training set\ncontains less than 1% of the posts. We further show that our techniques are\nrobust: they work even when we restrict our attention to the users who like\nboth hoax and non-hoax posts. These results suggest that mapping the diffusion\npattern of information can be a useful component of automatic hoax detection\nsystems.", "author": [{"name": "Eugenio Tacchini"}, {"name": "Gabriele Ballarin"}, {"name": "Marco L. Della Vedova"}, {"name": "Stefano Moret"}, {"name": "Luca de Alfaro"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Proceedings of the Second Workshop on Data Science for Social Good\n  (SoGood), Skopje, Macedonia, 2017. CEUR Workshop Proceedings Volume 1960,\n  2017"}, "link": [{"@href": "http://arxiv.org/abs/1704.07506v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1704.07506v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.HC", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1801.07311v3", "updated": "2020-06-15T08:53:51Z", "published": "2018-01-22T20:41:50Z", "title": "Early Detection of Social Media Hoaxes at Scale", "summary": "The unmoderated nature of social media enables the diffusion of hoaxes, which\nin turn jeopardises the credibility of information gathered from social media\nplatforms. Existing research on automated detection of hoaxes has the\nlimitation of using relatively small datasets, owing to the difficulty of\ngetting labelled data. This in turn has limited research exploring early\ndetection of hoaxes as well as exploring other factors such as the effect of\nthe size of the training data or the use of sliding windows. To mitigate this\nproblem, we introduce a semi-automated method that leverages the Wikidata\nknowledge base to build large-scale datasets for veracity classification,\nfocusing on celebrity death reports. This enables us to create a dataset with\n4,007 reports including over 13 million tweets, 15% of which are fake.\nExperiments using class-specific representations of word embeddings show that\nwe can achieve F1 scores nearing 72% within 10 minutes of the first tweet being\nposted when we expand the size of the training data following our\nsemi-automated means. Our dataset represents a realistic scenario with a real\ndistribution of true, commemorative and false stories, which we release for\nfurther use as a benchmark in future research.", "author": [{"name": "Arkaitz Zubiaga"}, {"name": "Aiqi Jiang"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "ACM Transactions on the Web (TWEB)"}, "link": [{"@href": "http://arxiv.org/abs/1801.07311v3", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1801.07311v3", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1610.04170v2", "updated": "2018-01-17T17:44:51Z", "published": "2016-10-13T16:48:45Z", "title": "Network segregation in a model of misinformation and fact checking", "summary": "Misinformation under the form of rumor, hoaxes, and conspiracy theories\nspreads on social media at alarming rates. One hypothesis is that, since social\nmedia are shaped by homophily, belief in misinformation may be more likely to\nthrive on those social circles that are segregated from the rest of the\nnetwork. One possible antidote is fact checking which, in some cases, is known\nto stop rumors from spreading further. However, fact checking may also backfire\nand reinforce the belief in a hoax. Here we take into account the combination\nof network segregation, finite memory and attention, and fact-checking efforts.\nWe consider a compartmental model of two interacting epidemic processes over a\nnetwork that is segregated between gullible and skeptic users. Extensive\nsimulation and mean-field analysis show that a more segregated network\nfacilitates the spread of a hoax only at low forgetting rates, but has no\neffect when agents forget at faster rates. This finding may inform the\ndevelopment of mitigation techniques and overall inform on the risks of\nuncontrolled misinformation online.", "author": [{"name": "Marcella Tambuscio"}, {"name": "Diego F. M. Oliveira"}, {"name": "Giovanni Luca Ciampaglia"}, {"name": "Giancarlo Ruffo"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1007/s42001-018-0018-9"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1007/s42001-018-0018-9", "@rel": "related"}, {"@href": "http://arxiv.org/abs/1610.04170v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1610.04170v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "J Comput Soc Sc (2018) 1: 261"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1312.5297v2", "updated": "2013-12-30T01:48:59Z", "published": "2013-12-18T20:13:27Z", "title": "Tweet, but Verify: Epistemic Study of Information Verification on\n  Twitter", "summary": "While Twitter provides an unprecedented opportunity to learn about breaking\nnews and current events as they happen, it often produces skepticism among\nusers as not all the information is accurate but also hoaxes are sometimes\nspread. While avoiding the diffusion of hoaxes is a major concern during\nfast-paced events such as natural disasters, the study of how users trust and\nverify information from tweets in these contexts has received little attention\nso far. We survey users on credibility perceptions regarding witness pictures\nposted on Twitter related to Hurricane Sandy. By examining credibility\nperceptions on features suggested for information verification in the field of\nEpistemology, we evaluate their accuracy in determining whether pictures were\nreal or fake compared to professional evaluations performed by experts. Our\nstudy unveils insight about tweet presentation, as well as features that users\nshould look at when assessing the veracity of tweets in the context of\nfast-paced events. Some of our main findings include that while author details\nnot readily available on Twitter feeds should be emphasized in order to\nfacilitate verification of tweets, showing multiple tweets corroborating a fact\nmisleads users to trusting what actually is a hoax. We contrast some of the\nbehavioral patterns found on tweets with literature in Psychology research.", "author": [{"name": "Arkaitz Zubiaga"}, {"name": "Heng Ji"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Pre-print of paper accepted to Social Network Analysis and Mining\n  (Springer)"}, "link": [{"@href": "http://arxiv.org/abs/1312.5297v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1312.5297v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1311.5835v1", "updated": "2013-11-22T18:13:03Z", "published": "2013-11-22T18:13:03Z", "title": "Some lessons for us scientists (too) from the \"Sokal affair\"", "summary": "In this little non-technical piece, I argue that some of the lessons that can\nbe learnt from the bold action carried out in 1996 by the physicist Alan Sokal\nand typically known as the \"Sokal affair\" not only apply to some sector of the\nhumanities (which was the original target of the hoax), but also (with much\nless intensity, but still) to the hardest sciences.", "author": {"name": "Pablo Echenique-Robba"}, "link": [{"@href": "http://arxiv.org/abs/1311.5835v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1311.5835v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.hist-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "physics.hist-ph", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/1908.09951v1", "updated": "2019-08-26T22:49:35Z", "published": "2019-08-26T22:49:35Z", "title": "An Emotional Analysis of False Information in Social Media and News\n  Articles", "summary": "Fake news is risky since it has been created to manipulate the readers'\nopinions and beliefs. In this work, we compared the language of false news to\nthe real one of real news from an emotional perspective, considering a set of\nfalse information types (propaganda, hoax, clickbait, and satire) from social\nmedia and online news articles sources. Our experiments showed that false\ninformation has different emotional patterns in each of its types, and emotions\nplay a key role in deceiving the reader. Based on that, we proposed a LSTM\nneural network model that is emotionally-infused to detect false news.", "author": [{"name": "Bilal Ghanem"}, {"name": "Paolo Rosso"}, {"name": "Francisco Rangel"}], "link": [{"@href": "http://arxiv.org/abs/1908.09951v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1908.09951v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2001.10926v1", "updated": "2020-01-29T16:14:47Z", "published": "2020-01-29T16:14:47Z", "title": "HoaxItaly: a collection of Italian disinformation and fact-checking\n  stories shared on Twitter in 2019", "summary": "We released over 1 million tweets shared during 2019 and containing links to\nthousands of news articles published on two classes of Italian outlets: (1)\ndisinformation websites, i.e. outlets which have been repeatedly flagged by\njournalists and fact-checkers for producing low-credibility content such as\nfalse news, hoaxes, click-bait, misleading and hyper-partisan stories; (2)\nfact-checking websites which notably debunk and verify online news and claims.\nThe dataset, which includes also title and body for approximately 37k news\narticles, is publicly available at https://doi.org/10.7910/DVN/ PGVDHX.", "author": [{"name": "Francesco Pierri"}, {"name": "Alessandro Artoni"}, {"name": "Stefano Ceri"}], "link": [{"@href": "http://arxiv.org/abs/2001.10926v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2001.10926v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1712.02904v2", "updated": "2018-04-09T16:38:45Z", "published": "2017-12-08T01:05:03Z", "title": "Experimental demonstration of an isotope-sensitive warhead verification\n  technique using nuclear resonance fluorescence", "summary": "Future nuclear arms reduction efforts will require technologies to verify\nthat warheads slated for dismantlement are authentic without revealing any\nsensitive weapons design information to international inspectors. Despite\nseveral decades of research, no technology has met these requirements\nsimultaneously. Recent work by Kemp et al. [Kemp RS, Danagoulian A, Macdonald\nRR, Vavrek JR (2016) Proc Natl Acad Sci USA 113:8618--8623] has produced a\nnovel physical cryptographic verification protocol that approaches this treaty\nverification problem by exploiting the isotope-specific nature of nuclear\nresonance fluorescence (NRF) measurements to verify the authenticity of a\nwarhead. To protect sensitive information, the NRF signal from the warhead is\nconvolved with that of an encryption foil that contains key warhead isotopes in\namounts unknown to the inspector. The convolved spectrum from a candidate\nwarhead is statistically compared against that from an authenticated template\nwarhead to determine whether the candidate itself is authentic. Here we report\non recent proof-of-concept warhead verification experiments conducted at the\nMassachusetts Institute of Technology. Using high-purity germanium (HPGe)\ndetectors, we measured NRF spectra from the interrogation of proxy 'genuine'\nand 'hoax' objects by a 2.52 MeV endpoint bremsstrahlung beam. The observed\ndifferences in NRF intensities near 2.2 MeV indicate that the physical\ncryptographic protocol can distinguish between proxy genuine and hoax objects\nwith high confidence in realistic measurement times.", "author": [{"name": "Jayson R Vavrek"}, {"name": "Brian S Henderson"}, {"name": "Areg Danagoulian"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1073/pnas.1721278115"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1073/pnas.1721278115", "@rel": "related"}, {"@href": "http://arxiv.org/abs/1712.02904v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1712.02904v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "38 pages, 19 figures; revised for peer review and copy editing;\n  addition to SI for realistic scenario projections; minor length reduction for\n  journal requirements"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Proc. Natl. Acad. Sci. U.S.A. 115 (17) 4363-4368 (2018)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.ins-det", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.ins-det", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2008.06854v1", "updated": "2020-08-16T08:06:52Z", "published": "2020-08-16T08:06:52Z", "title": "SGG: Spinbot, Grammarly and GloVe based Fake News Detection", "summary": "Recently, news consumption using online news portals has increased\nexponentially due to several reasons, such as low cost and easy accessibility.\nHowever, such online platforms inadvertently also become the cause of spreading\nfalse information across the web. They are being misused quite frequently as a\nmedium to disseminate misinformation and hoaxes. Such malpractices call for a\nrobust automatic fake news detection system that can keep us at bay from such\nmisinformation and hoaxes. We propose a robust yet simple fake news detection\nsystem, leveraging the tools for paraphrasing, grammar-checking, and\nword-embedding. In this paper, we try to the potential of these tools in\njointly unearthing the authenticity of a news article. Notably, we leverage\nSpinbot (for paraphrasing), Grammarly (for grammar-checking), and GloVe (for\nword-embedding) tools for this purpose. Using these tools, we were able to\nextract novel features that could yield state-of-the-art results on the Fake\nNews AMT dataset and comparable results on Celebrity datasets when combined\nwith some of the essential features. More importantly, the proposed method is\nfound to be more robust empirically than the existing ones, as revealed in our\ncross-domain analysis and multi-domain analysis.", "author": [{"name": "Akansha Gautam"}, {"name": "Koteswar Rao Jerripothula"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "9 pages, 7 figures, Accepted by IEEE International Conference on\n  Multimedia Big Data (BigMM), 2020"}, "link": [{"@href": "http://arxiv.org/abs/2008.06854v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2008.06854v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.MM", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/cond-mat/0211571v1", "updated": "2002-11-25T19:46:31Z", "published": "2002-11-25T19:46:31Z", "title": "Modeling Rumors: The No Plane Pentagon French Hoax Case", "summary": "The recent astonishing wide adhesion of french people to the rumor claiming\n`No plane did crash on the Pentagon on September the 11\", is given a generic\nexplanation in terms of a model of minority opinion spreading. Using a majority\nrule reaction-diffusion dynamics, a rumor is shown to invade for sure a social\ngroup provided it fulfills simultaneously two criteria. First it must initiate\nwith a support beyond some critical threshold which however, turns out to be\nalways very low. Then it has to be consistent with some larger collective\nsocial paradigm of the group. Othewise it just dies out. Both conditions were\nsatisfied in the french case with the associated book sold at more than 200 000\ncopies in just a few days. The rumor was stopped by the firm stand of most\nnewspaper editors stating it is nonsense. Such an incredible social dynamics is\nshown to result naturally from an open and free public debate among friends and\ncolleagues. Each one searching for the truth sincerely on a free will basis and\nwithout individual biases. The polarization process appears also to be very\nquick in agreement with reality. It is a very strong anti-democratic reversal\nof opinion although made quite democratically. The model may apply to a large\nrange of rumors.", "author": {"name": "Serge Galam"}, "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1016/S0378-4371(02)01582-0"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1016/S0378-4371(02)01582-0", "@rel": "related"}, {"@href": "http://arxiv.org/abs/cond-mat/0211571v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/cond-mat/0211571v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cond-mat.dis-nn", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cond-mat.dis-nn", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/q-bio/0603010v2", "updated": "2006-09-28T15:42:41Z", "published": "2006-03-07T18:55:41Z", "title": "Spreading dynamics on small-world networks with connectivity\n  fluctuations and correlations", "summary": "Infectious diseases and computer malwares spread among humans and computers\nthrough the network of contacts among them. These networks are characterized by\nwide connectivity fluctuations, connectivity correlations and the small-world\nproperty. In a previous work [A. Vazquez, Phys. Rev. Lett. 96, 038702 (2006)] I\nhave shown that the connectivity fluctuations together with the small-world\nproperty lead to a novel spreading law, characterized by an initial power law\ngrowth with an exponent determined by the average node distance on the network.\nHere I extend these results to consider the influence of connectivity\ncorrelations which are generally observed in real networks. I show that\nassortative and disassortative connectivity correlations enhance and diminish,\nrespectively, the range of validity of this spreading law. As a corollary I\nobtain the region of connectivity fluctuations and degree correlations\ncharacterized by the absence of an epidemic threshold. These results are\nrelevant for the spreading of infectious diseases, rumors, and information\namong humans and the spreading of computer viruses, email worms and hoaxes\namong computer users.", "author": {"name": "Alexei Vazquez"}, "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1103/PhysRevE.74.056101"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1103/PhysRevE.74.056101", "@rel": "related"}, {"@href": "http://arxiv.org/abs/q-bio/0603010v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/q-bio/0603010v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10 pages, 1 figure, RevTex. Phys. Rev. E (In press)"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Phys. Rev. E 74, 056101 (2006)"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "q-bio.PE", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "q-bio.PE", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cond-mat.dis-nn", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "q-bio.QM", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/0812.0342v2", "updated": "2009-01-13T13:34:31Z", "published": "2008-12-01T19:04:52Z", "title": "Gauge coupling unification, the GUT scale, and magic fields", "summary": "We consider field sets that do not form complete SU(5) multiplets, but\nexactly preserve the one-loop MSSM prediction for $\\alpha_3(M_Z)$ independently\nof the value of their mass. Such fields can raise the unification scale in\ndifferent ways, through a delayed convergence of the gauge couplings, a fake\nunified running below the GUT scale, or a postponed unification after a hoax\ncrossing at a lower scale. The $\\alpha_3(M_Z)$ prediction is independent of the\nmass of the new fields, while the GUT scale often is not, which allows to vary\nthe GUT scale. Such \"magic\" fields represent a useful tool in GUT model\nbuilding. For example, they can be used to fix gauge coupling unification in\ncertain two step breakings of the unified group, to suppress large KK\nthresholds in models with extra dimensions, or they can be interpreted as\nmessengers of supersymmetry breaking in GMSB models.", "author": [{"name": "L. Calibbi"}, {"name": "L. Ferretti"}, {"name": "A. Romanino"}, {"name": "R. Ziegler"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1016/j.physletb.2009.01.012"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1016/j.physletb.2009.01.012", "@rel": "related"}, {"@href": "http://arxiv.org/abs/0812.0342v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/0812.0342v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "14 pages, 3 figures. Typos corrected in text and equations, reference\n  added"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Phys.Lett.B672:152-157,2009"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "hep-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "hep-ph", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/1004.1190v1", "updated": "2010-04-07T21:10:40Z", "published": "2010-04-07T21:10:40Z", "title": "Can Social Networks help the progress of Astrophysics and Cosmology? An\n  experiment in the field of Galaxy Kinematics", "summary": "This paper is crucial part of an experiment aimed to investigate whether\nSocial Networks can be of help for Astrophysics. In the present case, in\nhelping to eliminate the deep-routed wrong misconception of Flat Rotation\nCurves of Spiral Galaxies, more rapidly and efficiently than the traditional\nmethod of publishing peer-reviewed papers and organizing a number of\ninternational conferences. To reach this goal we created the Facebook Group\n\"Rotation Curve are not Flat\" that we filled with all the evidence necessary\nfor an immediate and definite confrontation with the above fallacious legendary\nbelief. In this paper, we solicit the interested Astrophysicist/Cosmologist FB\nusers to join this group. Finally, the paper informs the Astrophysical\nCommunity that a widespread belief is instead an hoax, whose consideration may\nslow down the progress of science and that must be taken care by innovative\nmeans of communicating scientific advances. This test case may anticipate the\nfuture in which Web n.0 will become an effective scientific tool for\nAstrophysics.", "author": {"name": "Paolo Salucci"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "7 pages, 1 figure, Submitted to JCOM"}, "link": [{"@href": "http://arxiv.org/abs/1004.1190v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1004.1190v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "astro-ph.IM", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "astro-ph.IM", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "astro-ph.GA", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "gr-qc", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1609.09435v1", "updated": "2016-09-29T17:31:44Z", "published": "2016-09-29T17:31:44Z", "title": "On the statistical properties of viral misinformation in online social\n  media", "summary": "The massive diffusion of online social media allows for the rapid and\nuncontrolled spreading of conspiracy theories, hoaxes, unsubstantiated claims,\nand false news. Such an impressive amount of misinformation can influence\npolicy preferences and encourage behaviors strongly divergent from recommended\npractices. In this paper, we study the statistical properties of viral\nmisinformation in online social media. By means of methods belonging to Extreme\nValue Theory, we show that the number of extremely viral posts over time\nfollows a homogeneous Poisson process, and that the interarrival times between\nsuch posts are independent and identically distributed, following an\nexponential distribution. Moreover, we characterize the uncertainty around the\nrate parameter of the Poisson process through Bayesian methods. Finally, we are\nable to derive the predictive posterior probability distribution of the number\nof posts exceeding a certain threshold of shares over a finite interval of\ntime.", "author": {"name": "Alessandro Bessi"}, "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1016/j.physa.2016.11.012"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1016/j.physa.2016.11.012", "@rel": "related"}, {"@href": "http://arxiv.org/abs/1609.09435v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1609.09435v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "stat.AP", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1709.01634v2", "updated": "2017-10-06T16:52:11Z", "published": "2017-09-06T00:15:37Z", "title": "The Voynich Manuscript is Written in Natural Language: The Pahlavi\n  Hypothesis", "summary": "The late medieval Voynich Manuscript (VM) has resisted decryption and was\nconsidered a meaningless hoax or an unsolvable cipher. Here, we provide\nevidence that the VM is written in natural language by establishing a relation\nof the Voynich alphabet and the Iranian Pahlavi script. Many of the Voynich\ncharacters are upside-down versions of their Pahlavi counterparts, which may be\nan effect of different writing directions. Other Voynich letters can be\nexplained as ligatures or departures from Pahlavi with the intent to cope with\nknown problems due to the stupendous ambiguity of Pahlavi text. While a\ntranslation of the VM text is not attempted here, we can confirm the\nVoynich-Pahlavi relation at the character level by the transcription of many\nwords from the VM illustrations and from parts of the main text. Many of the\ntranscribed words can be identified as terms from Zoroastrian cosmology which\nis in line with the use of Pahlavi script in Zoroastrian communities from\nmedieval times.", "author": {"name": "J. Michael Herrmann"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "23 pages, 15 figures, 4 tables. Second version: one reference added,\n  duplicate text removed from introduction"}, "link": [{"@href": "http://arxiv.org/abs/1709.01634v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1709.01634v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/1709.09736v1", "updated": "2017-09-27T21:20:50Z", "published": "2017-09-27T21:20:50Z", "title": "Nuclear Disarmament Verification via Resonant Phenomena", "summary": "Nuclear disarmament treaties are not sufficient in and of themselves to\nneutralize the existential threat of the nuclear weapons. Technologies are\nnecessary for verifying the authenticity of the nuclear warheads undergoing\ndismantlement before counting them towards a treaty partner's obligation. This\nwork presents a novel concept that leverages isotope-specific nuclear resonance\nphenomena to authenticate a warhead's fissile components by comparing them to a\npreviously authenticated template. All information is encrypted in the physical\ndomain in a manner that amounts to a physical zero-knowledge proof system.\nUsing Monte Carlo simulations, the system is shown to reveal no isotopic or\ngeometric information about the weapon, while readily detecting hoaxing\nattempts. This nuclear technique can dramatically increase the reach and\ntrustworthiness of future nuclear disarmament treaties.", "author": [{"name": "Jake J. Hecla"}, {"name": "Areg Danagoulian"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1038/s41467-018-03680-4"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1038/s41467-018-03680-4", "@rel": "related"}, {"@href": "http://arxiv.org/abs/1709.09736v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1709.09736v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Nature Communications 2018"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.ins-det", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1802.01400v1", "updated": "2018-02-05T14:17:21Z", "published": "2018-02-05T14:17:21Z", "title": "Polarization and Fake News: Early Warning of Potential Misinformation\n  Targets", "summary": "Users polarization and confirmation bias play a key role in misinformation\nspreading on online social media. Our aim is to use this information to\ndetermine in advance potential targets for hoaxes and fake news. In this paper,\nwe introduce a general framework for promptly identifying polarizing content on\nsocial media and, thus, \"predicting\" future fake news topics. We validate the\nperformances of the proposed methodology on a massive Italian Facebook dataset,\nshowing that we are able to identify topics that are susceptible to\nmisinformation with 77% accuracy. Moreover, such information may be embedded as\na new feature in an additional classifier able to recognize fake news with 91%\naccuracy. The novelty of our approach consists in taking into account a series\nof characteristics related to users behavior on online social media, making a\nfirst, important step towards the smoothing of polarization and the mitigation\nof misinformation phenomena.", "author": [{"name": "Michela Del Vicario"}, {"name": "Walter Quattrociocchi"}, {"name": "Antonio Scala"}, {"name": "Fabiana Zollo"}], "link": [{"@href": "http://arxiv.org/abs/1802.01400v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1802.01400v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/1910.03496v2", "updated": "2019-10-11T05:36:23Z", "published": "2019-09-29T17:45:48Z", "title": "Fake news detection using Deep Learning", "summary": "The evolution of the information and communication technologies has\ndramatically increased the number of people with access to the Internet, which\nhas changed the way the information is consumed. As a consequence of the above,\nfake news have become one of the major concerns because its potential to\ndestabilize governments, which makes them a potential danger to modern society.\nAn example of this can be found in the US. electoral campaign, where the term\n\"fake news\" gained great notoriety due to the influence of the hoaxes in the\nfinal result of these. In this work the feasibility of applying deep learning\ntechniques to discriminate fake news on the Internet using only their text is\nstudied. In order to accomplish that, three different neural network\narchitectures are proposed, one of them based on BERT, a modern language model\ncreated by Google which achieves state-of-the-art results.", "author": [{"name": "Álvaro Ibrain Rodríguez"}, {"name": "Lara Lloret Iglesias"}], "link": [{"@href": "http://arxiv.org/abs/1910.03496v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1910.03496v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1910.12203v1", "updated": "2019-10-27T07:44:33Z", "published": "2019-10-27T07:44:33Z", "title": "Do Sentence Interactions Matter? Leveraging Sentence Level\n  Representations for Fake News Classification", "summary": "The rising growth of fake news and misleading information through online\nmedia outlets demands an automatic method for detecting such news articles. Of\nthe few limited works which differentiate between trusted vs other types of\nnews article (satire, propaganda, hoax), none of them model sentence\ninteractions within a document. We observe an interesting pattern in the way\nsentences interact with each other across different kind of news articles. To\ncapture this kind of information for long news articles, we propose a graph\nneural network-based model which does away with the need of feature engineering\nfor fine grained fake news classification. Through experiments, we show that\nour proposed method beats strong neural baselines and achieves state-of-the-art\naccuracy on existing datasets. Moreover, we establish the generalizability of\nour model by evaluating its performance in out-of-domain scenarios. Code is\navailable at https://github.com/MysteryVaibhav/fake_news_semantics", "author": [{"name": "Vaibhav Vaibhav"}, {"name": "Raghuram Mandyam Annasamy"}, {"name": "Eduard Hovy"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Accepted at TextGraphs - EMNLP 2019"}, "link": [{"@href": "http://arxiv.org/abs/1910.12203v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1910.12203v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "stat.ML", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1804.08559v1", "updated": "2018-04-23T16:52:49Z", "published": "2018-04-23T16:52:49Z", "title": "False Information on Web and Social Media: A Survey", "summary": "False information can be created and spread easily through the web and social\nmedia platforms, resulting in widespread real-world impact. Characterizing how\nfalse information proliferates on social platforms and why it succeeds in\ndeceiving readers are critical to develop efficient detection algorithms and\ntools for early detection. A recent surge of research in this area has aimed to\naddress the key issues using methods based on feature engineering, graph\nmining, and information modeling. Majority of the research has primarily\nfocused on two broad categories of false information: opinion-based (e.g., fake\nreviews), and fact-based (e.g., false news and hoaxes). Therefore, in this\nwork, we present a comprehensive survey spanning diverse aspects of false\ninformation, namely (i) the actors involved in spreading false information,\n(ii) rationale behind successfully deceiving readers, (iii) quantifying the\nimpact of false information, (iv) measuring its characteristics across\ndifferent dimensions, and finally, (iv) algorithms developed to detect false\ninformation. In doing so, we create a unified framework to describe these\nrecent methods and highlight a number of important directions for future\nresearch.", "author": [{"name": "Srijan Kumar"}, {"name": "Neil Shah"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "To appear in the book titled Social Media Analytics: Advances and\n  Applications, by CRC press, 2018"}, "link": [{"@href": "http://arxiv.org/abs/1804.08559v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1804.08559v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.DL", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1805.05999v2", "updated": "2018-05-17T09:33:35Z", "published": "2018-05-15T19:09:41Z", "title": "Agent Based Rumor Spreading in a scale-free network", "summary": "In the last years, the study of rumor spreading on social networks produced a\nlot of interest among the scientific community, expecially due to the role of\nsocial networks in the last political events. The goal of this work is to\nreproduce real-like diffusions of information and misinformation in a\nscale-free network using a multi-agent-based model. The data concerning the\nvirtual spreading are easily obtainable, in particular the diffusion of\ninformation during the announcement for the discovery of the Higgs Boson on\nTwitter was recorded and investigated in detail. We made some assumptions on\nthe micro behavior of our agents and registered the effects in a statistical\nanalysis replying the real data diffusion. Then, we studied an hypotetical\nresponse to a misinformation diffusion adding debunking agents and trying to\nmodel a critic response from the agents using real data from a hoax regarding\nthe Occupy Wall Street movement. After tuning our model to reproduce these\nresults, we measured some network properties and proved the emergence of\nsubstantially separated structures like echochambers, independently from the\nnetwork size scale, i.e. with one hundred, one thousand and ten thousand\nagents.", "author": [{"name": "Mattia Mazzoli"}, {"name": "Tullio Re"}, {"name": "Roberto Bertilone"}, {"name": "Marco Maggiora"}, {"name": "Jacopo Pellegrino"}], "link": [{"@href": "http://arxiv.org/abs/1805.05999v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1805.05999v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.MA", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.MA", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "68T42", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1603.01511v1", "updated": "2016-03-04T15:59:06Z", "published": "2016-03-04T15:59:06Z", "title": "Hoaxy: A Platform for Tracking Online Misinformation", "summary": "Massive amounts of misinformation have been observed to spread in\nuncontrolled fashion across social media. Examples include rumors, hoaxes, fake\nnews, and conspiracy theories. At the same time, several journalistic\norganizations devote significant efforts to high-quality fact checking of\nonline claims. The resulting information cascades contain instances of both\naccurate and inaccurate information, unfold over multiple time scales, and\noften reach audiences of considerable size. All these factors pose challenges\nfor the study of the social dynamics of online news sharing. Here we introduce\nHoaxy, a platform for the collection, detection, and analysis of online\nmisinformation and its related fact-checking efforts. We discuss the design of\nthe platform and present a preliminary analysis of a sample of public tweets\ncontaining both fake news and fact checking. We find that, in the aggregate,\nthe sharing of fact-checking content typically lags that of misinformation by\n10--20 hours. Moreover, fake news are dominated by very active users, while\nfact checking is a more grass-roots activity. With the increasing risks\nconnected to massive online misinformation, social news observatories have the\npotential to help researchers, journalists, and the general public understand\nthe dynamics of real and fake news sharing.", "author": [{"name": "Chengcheng Shao"}, {"name": "Giovanni Luca Ciampaglia"}, {"name": "Alessandro Flammini"}, {"name": "Filippo Menczer"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1145/2872518.2890098"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1145/2872518.2890098", "@rel": "related"}, {"@href": "http://arxiv.org/abs/1603.01511v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1603.01511v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "6 pages, 6 figures, submitted to Third Workshop on Social News On the\n  Web"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2008.11308v2", "updated": "2021-05-18T08:13:48Z", "published": "2020-08-25T23:35:01Z", "title": "Identifying Coordinated Accounts on Social Media through Hidden\n  Influence and Group Behaviours", "summary": "Disinformation campaigns on social media, involving coordinated activities\nfrom malicious accounts towards manipulating public opinion, have become\nincreasingly prevalent. Existing approaches to detect coordinated accounts\neither make very strict assumptions about coordinated behaviours, or require\npart of the malicious accounts in the coordinated group to be revealed in order\nto detect the rest. To address these drawbacks, we propose a generative model,\nAMDN-HAGE (Attentive Mixture Density Network with Hidden Account Group\nEstimation) which jointly models account activities and hidden group behaviours\nbased on Temporal Point Processes (TPP) and Gaussian Mixture Model (GMM), to\ncapture inherent characteristics of coordination which is, accounts that\ncoordinate must strongly influence each other's activities, and collectively\nappear anomalous from normal accounts. To address the challenges of optimizing\nthe proposed model, we provide a bilevel optimization algorithm with\ntheoretical guarantee on convergence. We verified the effectiveness of the\nproposed method and training algorithm on real-world social network data\ncollected from Twitter related to coordinated campaigns from Russia's Internet\nResearch Agency targeting the 2016 U.S. Presidential Elections, and to identify\ncoordinated campaigns related to the COVID-19 pandemic. Leveraging the learned\nmodel, we find that the average influence between coordinated account pairs is\nthe highest.On COVID-19, we found coordinated group spreading anti-vaccination,\nanti-masks conspiracies that suggest the pandemic is a hoax and political scam.", "author": [{"name": "Karishma Sharma"}, {"name": "Yizhou Zhang"}, {"name": "Emilio Ferrara"}, {"name": "Yan Liu"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "KDD'2021 (Accepted)"}, "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "ACM SIGKDD International Conference on Knowledge Discovery & Data\n  Mining 2021"}, "link": [{"@href": "http://arxiv.org/abs/2008.11308v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2008.11308v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2010.02097v1", "updated": "2020-10-05T15:34:52Z", "published": "2020-10-05T15:34:52Z", "title": "FaNDS: Fake News Detection System Using Energy Flow", "summary": "Recently, the term \"fake news\" has been broadly and extensively utilized for\ndisinformation, misinformation, hoaxes, propaganda, satire, rumors, click-bait,\nand junk news. It has become a serious problem around the world. We present a\nnew system, FaNDS, that detects fake news efficiently. The system is based on\nseveral concepts used in some previous works but in a different context. There\nare two main concepts: an Inconsistency Graph and Energy Flow. The\nInconsistency Graph contains news items as nodes and inconsistent opinions\nbetween them for edges. Energy Flow assigns each node an initial energy and\nthen some energy is propagated along the edges until the energy distribution on\nall nodes converges. To illustrate FaNDS we use the original data from the Fake\nNews Challenge (FNC-1). First, the data has to be reconstructed in order to\ngenerate the Inconsistency Graph. The graph contains various subgraphs with\nwell-defined shapes that represent different types of connections between the\nnews items. Then the Energy Flow method is applied. The nodes with high energy\nare the candidates for being fake news. In our experiments, all these were\nindeed fake news as we checked each using several reliable web sites. We\ncompared FaNDS to several other fake news detection methods and found it to be\nmore sensitive in discovering fake news items.", "author": [{"name": "Jiawei Xu"}, {"name": "Vladimir Zadorozhny"}, {"name": "Danchen Zhang"}, {"name": "John Grant"}], "link": [{"@href": "http://arxiv.org/abs/2010.02097v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2010.02097v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2010.07647v2", "updated": "2021-07-06T09:16:25Z", "published": "2020-10-15T10:31:28Z", "title": "Identifying Possible Rumor Spreaders on Twitter: A Weak Supervised\n  Learning Approach", "summary": "Online Social Media (OSM) platforms such as Twitter, Facebook are extensively\nexploited by the users of these platforms for spreading the (mis)information to\na large audience effortlessly at a rapid pace. It has been observed that the\nmisinformation can cause panic, fear, and financial loss to society. Thus, it\nis important to detect and control the misinformation in such platforms before\nit spreads to the masses. In this work, we focus on rumors, which is one type\nof misinformation (other types are fake news, hoaxes, etc). One way to control\nthe spread of the rumors is by identifying users who are possibly the rumor\nspreaders, that is, users who are often involved in spreading the rumors. Due\nto the lack of availability of rumor spreaders labeled dataset (which is an\nexpensive task), we use publicly available PHEME dataset, which contains rumor\nand non-rumor tweets information, and then apply a weak supervised learning\napproach to transform the PHEME dataset into rumor spreaders dataset. We\nutilize three types of features, that is, user, text, and ego-network features,\nbefore applying various supervised learning approaches. In particular, to\nexploit the inherent network property in this dataset (user-user reply graph),\nwe explore Graph Convolutional Network (GCN), a type of Graph Neural Network\n(GNN) technique. We compare GCN results with the other approaches: SVM, RF, and\nLSTM. Extensive experiments performed on the rumor spreaders dataset, where we\nachieve up to 0.864 value for F1-Score and 0.720 value for AUC-ROC, shows the\neffectiveness of our methodology for identifying possible rumor spreaders using\nthe GCN technique.", "author": [{"name": "Shakshi Sharma"}, {"name": "Rajesh Sharma"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Published at The International Joint Conference on Neural Networks\n  2021 (IJCNN2021). Please cite the IJCNN version"}, "link": [{"@href": "http://arxiv.org/abs/2010.07647v2", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2010.07647v2", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.AI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2103.00484v1", "updated": "2021-02-25T18:26:50Z", "published": "2021-02-25T18:26:50Z", "title": "Deepfakes Generation and Detection: State-of-the-art, open challenges,\n  countermeasures, and way forward", "summary": "Easy access to audio-visual content on social media, combined with the\navailability of modern tools such as Tensorflow or Keras, open-source trained\nmodels, and economical computing infrastructure, and the rapid evolution of\ndeep-learning (DL) methods, especially Generative Adversarial Networks (GAN),\nhave made it possible to generate deepfakes to disseminate disinformation,\nrevenge porn, financial frauds, hoaxes, and to disrupt government functioning.\nThe existing surveys have mainly focused on deepfake video detection only. No\nattempt has been made to review approaches for detection and generation of both\naudio and video deepfakes. This paper provides a comprehensive review and\ndetailed analysis of existing tools and machine learning (ML) based approaches\nfor deepfake generation and the methodologies used to detect such manipulations\nfor the detection and generation of both audio and video deepfakes. For each\ncategory of deepfake, we discuss information related to manipulation\napproaches, current public datasets, and key standards for the performance\nevaluation of deepfake detection techniques along with their results.\nAdditionally, we also discuss open challenges and enumerate future directions\nto guide future researchers on issues that need to be considered to improve the\ndomains of both the deepfake generation and detection. This work is expected to\nassist the readers in understanding the creation and detection mechanisms of\ndeepfake, along with their current limitations and future direction.", "author": [{"name": "Momina Masood"}, {"name": "Marriam Nawaz"}, {"name": "Khalid Mahmood Malik"}, {"name": "Ali Javed"}, {"name": "Aun Irtaza"}], "link": [{"@href": "http://arxiv.org/abs/2103.00484v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2103.00484v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CR", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CR", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.LG", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SD", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "eess.AS", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "eess.IV", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2103.12191v1", "updated": "2021-03-22T21:44:32Z", "published": "2021-03-22T21:44:32Z", "title": "Using an Epidemiological Model to Study the Spread of Misinformation\n  during the Black Lives Matter Movement", "summary": "The proliferation of social media platforms like Twitter has heightened the\nconsequences of the spread of misinformation. To understand and model the\nspread of misinformation, in this paper, we leveraged the SEIZ (Susceptible,\nExposed, Infected, Skeptics) epidemiological model to describe the underlying\nprocess that delineates the spread of misinformation on Twitter. Compared to\nthe other epidemiological models, this model produces broader results because\nit includes the additional Skeptics (Z) compartment, wherein a user may be\nexposed to an item of misinformation but not engage in any reaction to it, and\nthe additional Exposed (E) compartment, wherein the user may need some time\nbefore deciding to spread a misinformation item. We analyzed misinformation\nregarding the unrest in Washington, D.C. in the month of March 2020 which was\npropagated by the use of the #DCblackout hashtag by different users across the\nU.S. on Twitter. Our analysis shows that misinformation can be modeled using\nthe concept of epidemiology. To the best of our knowledge, this research is the\nfirst to attempt to apply the SEIZ epidemiological model to the spread of a\nspecific item of misinformation, which is a category distinct from that of\nrumor, and a hoax on online social media platforms. Applying a mathematical\nmodel can help to understand the trends and dynamics of the spread of\nmisinformation on Twitter and ultimately help to develop techniques to quickly\nidentify and control it.", "author": [{"name": "Maryam Maleki"}, {"name": "Esther Mead"}, {"name": "Mohammad Arani"}, {"name": "Nitin Agarwal"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "This paper is accepted on the International Conference on Fake News,\n  Social Media Manipulation and Misinformation 2021 (ICFNSMMM 2021)"}, "link": [{"@href": "http://arxiv.org/abs/2103.12191v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2103.12191v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}}, {"id": "http://arxiv.org/abs/2107.05381v1", "updated": "2021-07-07T23:39:59Z", "published": "2021-07-07T23:39:59Z", "title": "Can Evolutionary Computation Help us to Crib the Voynich Manuscript ?", "summary": "Departing from the postulate that Voynich Manuscript is not a hoax but rather\nencodes authentic contents, our article presents an evolutionary algorithm\nwhich aims to find the most optimal mapping between voynichian glyphs and\ncandidate phonemic values. Core component of the decoding algorithm is a\nprocess of maximization of a fitness function which aims to find most optimal\nset of substitution rules allowing to transcribe the part of the manuscript --\nwhich we call the Calendar -- into lists of feminine names. This leads to sets\nof character subsitution rules which allow us to consistently transcribe dozens\namong three hundred calendar tokens into feminine names: a result far\nsurpassing both ``popular'' as well as \"state of the art\" tentatives to crack\nthe manuscript. What's more, by using name lists stemming from different\nlanguages as potential cribs, our ``adaptive'' method can also be useful in\nidentification of the language in which the manuscript is written.\n  As far as we can currently tell, results of our experiments indicate that the\nCalendar part of the manuscript contains names from baltoslavic, balkanic or\nhebrew language strata. Two further indications are also given: primo, highest\nfitness values were obtained when the crib list contains names with specific\ninfixes at token's penultimate position as is the case, for example, for slavic\n\\textbf{feminine diminutives} (i.e. names ending with -ka and not -a). In the\nmost successful scenario, 240 characters contained in 35 distinct Voynichese\ntokens were successfully transcribed. Secundo, in case of crib stemming from\nHebrew language, whole adaptation process converges to significantly better\nfitness values when transcribing voynichian tokens whose order of individual\ncharacters have been reversed, and when lists feminine and not masculine names\nare used as the crib.", "author": {"name": "Daniel Devatman Hromada"}, "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "16 pages, 3 figures, 2 source code snippets"}, "link": [{"@href": "http://arxiv.org/abs/2107.05381v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2107.05381v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.IR", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/1804.03461v3", "updated": "2019-01-18T18:12:27Z", "published": "2018-04-10T11:31:27Z", "title": "The Web of False Information: Rumors, Fake News, Hoaxes, Clickbait, and\n  Various Other Shenanigans", "summary": "A new era of Information Warfare has arrived. Various actors, including\nstate-sponsored ones, are weaponizing information on Online Social Networks to\nrun false information campaigns with targeted manipulation of public opinion on\nspecific topics. These false information campaigns can have dire consequences\nto the public: mutating their opinions and actions, especially with respect to\ncritical world events like major elections. Evidently, the problem of false\ninformation on the Web is a crucial one, and needs increased public awareness,\nas well as immediate attention from law enforcement agencies, public\ninstitutions, and in particular, the research community. In this paper, we make\na step in this direction by providing a typology of the Web's false information\necosystem, comprising various types of false information, actors, and their\nmotives. We report a comprehensive overview of existing research on the false\ninformation ecosystem by identifying several lines of work: 1) how the public\nperceives false information; 2) understanding the propagation of false\ninformation; 3) detecting and containing false information on the Web; and 4)\nfalse information on the political stage. In this work, we pay particular\nattention to political false information as: 1) it can have dire consequences\nto the community (e.g., when election results are mutated) and 2) previous work\nshow that this type of false information propagates faster and further when\ncompared to other types of false information. Finally, for each of these lines\nof work, we report several future research directions that can help us better\nunderstand and mitigate the emerging problem of false information dissemination\non the Web.", "author": [{"name": "Savvas Zannettou"}, {"name": "Michael Sirivianos"}, {"name": "Jeremy Blackburn"}, {"name": "Nicolas Kourtellis"}], "arxiv:doi": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "10.1145/3309699"}, "link": [{"@title": "doi", "@href": "http://dx.doi.org/10.1145/3309699", "@rel": "related"}, {"@href": "http://arxiv.org/abs/1804.03461v3", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/1804.03461v3", "@rel": "related", "@type": "application/pdf"}], "arxiv:journal_ref": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Journal of Data and Information Quality (JDIQ) 2019"}, "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2004.13783v1", "updated": "2020-04-28T19:27:48Z", "published": "2020-04-28T19:27:48Z", "title": "Conspiracy in the Time of Corona: Automatic detection of Covid-19\n  Conspiracy Theories in Social Media and the News", "summary": "Rumors and conspiracy theories thrive in environments of low confidence and\nlow trust. Consequently, it is not surprising that ones related to the Covid-19\npandemic are proliferating given the lack of any authoritative scientific\nconsensus on the virus, its spread and containment, or on the long term social\nand economic ramifications of the pandemic. Among the stories currently\ncirculating are ones suggesting that the 5G network activates the virus, that\nthe pandemic is a hoax perpetrated by a global cabal, that the virus is a\nbio-weapon released deliberately by the Chinese, or that Bill Gates is using it\nas cover to launch a global surveillance regime. While some may be quick to\ndismiss these stories as having little impact on real-world behavior, recent\nevents including the destruction of property, racially fueled attacks against\nAsian Americans, and demonstrations espousing resistance to public health\norders countermand such conclusions. Inspired by narrative theory, we crawl\nsocial media sites and news reports and, through the application of automated\nmachine-learning methods, discover the underlying narrative frameworks\nsupporting the generation of these stories. We show how the various narrative\nframeworks fueling rumors and conspiracy theories rely on the alignment of\notherwise disparate domains of knowledge, and consider how they attach to the\nbroader reporting on the pandemic. These alignments and attachments, which can\nbe monitored in near real-time, may be useful for identifying areas in the news\nthat are particularly vulnerable to reinterpretation by conspiracy theorists.\nUnderstanding the dynamics of storytelling on social media and the narrative\nframeworks that provide the generative basis for these stories may also be\nhelpful for devising methods to disrupt their spread.", "author": [{"name": "Shadi Shahsavari"}, {"name": "Pavan Holur"}, {"name": "Timothy R. Tangherlini"}, {"name": "Vwani Roychowdhury"}], "arxiv:comment": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "#text": "Covid-19, Corona virus, conspiracy theories, 5G, Bill Gates, China,\n  bio-weapons, rumor, narrative, machinelearning, social media, 4Chan, Reddit,\n  networks, data visualization"}, "link": [{"@href": "http://arxiv.org/abs/2004.13783v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2004.13783v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}, {"id": "http://arxiv.org/abs/2103.15909v1", "updated": "2021-03-29T19:38:13Z", "published": "2021-03-29T19:38:13Z", "title": "Cognitive networks identify the content of English and Italian popular\n  posts about COVID-19 vaccines: Anticipation, logistics, conspiracy and loss\n  of trust", "summary": "Monitoring social discourse about COVID-19 vaccines is key to understanding\nhow large populations perceive vaccination campaigns. We focus on 4765 unique\npopular tweets in English or Italian about COVID-19 vaccines between 12/2020\nand 03/2021. One popular English tweet was liked up to 495,000 times, stressing\nhow popular tweets affected cognitively massive populations. We investigate\nboth text and multimedia in tweets, building a knowledge graph of\nsyntactic/semantic associations in messages including visual features and\nindicating how online users framed social discourse mostly around the logistics\nof vaccine distribution. The English semantic frame of \"vaccine\" was highly\npolarised between trust/anticipation (towards the vaccine as a scientific asset\nsaving lives) and anger/sadness (mentioning critical issues with dose\nadministering). Semantic associations with \"vaccine,\" \"hoax\" and conspiratorial\njargon indicated the persistence of conspiracy theories and vaccines in\nmassively read English posts (absent in Italian messages). The image analysis\nfound that popular tweets with images of people wearing face masks used\nlanguage lacking the trust and joy found in tweets showing people with no\nmasks, indicating a negative affect attributed to face covering in social\ndiscourse. A behavioural analysis revealed a tendency for users to share\ncontent eliciting joy, sadness and disgust and to like less sad messages,\nhighlighting an interplay between emotions and content diffusion beyond\nsentiment. With the AstraZeneca vaccine being suspended in mid March 2021,\n\"Astrazeneca\" was associated with trustful language driven by experts, but\npopular Italian tweets framed \"vaccine\" by crucially replacing earlier levels\nof trust with deep sadness. Our results stress how cognitive networks and\ninnovative multimedia processing open new ways for reconstructing online\nperceptions about vaccines and trust.", "author": [{"name": "Massimo Stella"}, {"name": "Michael S. Vitevitch"}, {"name": "Federico Botta"}], "link": [{"@href": "http://arxiv.org/abs/2103.15909v1", "@rel": "alternate", "@type": "text/html"}, {"@title": "pdf", "@href": "http://arxiv.org/pdf/2103.15909v1", "@rel": "related", "@type": "application/pdf"}], "arxiv:primary_category": {"@xmlns:arxiv": "http://arxiv.org/schemas/atom", "@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, "category": [{"@term": "physics.soc-ph", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CL", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.CY", "@scheme": "http://arxiv.org/schemas/atom"}, {"@term": "cs.SI", "@scheme": "http://arxiv.org/schemas/atom"}]}]